/* Copyright (C) The uOFW team
   See the file COPYING for copying permission.
*/

/*
 * uofw/src/power/battery.c
 *
 * This file implements the battery feature area of the power service. It provides public APIs to query the current
 * power supply (is supplied by battery or AC) and battery state (remaining battery capacity, current temperature,
 * voltage, charge cycle,...). Internally, we set up a worker thread which periodically polls the battery to update
 * the collected battery properties.
 * 
 * Starting with the PSP N-1000 (PSP-Go) serie, the battery equipped by default no longer has hardware included to
 * monitor the current battery state. In this case, the power service tries to estimate the current remaining battery
 * capacity based on the current battery voltage.
 * 
 * The battery feature area also provides public APIs to control the charging policies of the PSP system. Battery
 * charging can be allowed/disallowed and whether or not the battery can be charged over USB or not (if the PSP
 * device has a USB charging capability).
 * 
 * Last but not least, battery.c also implements a public API to query whether or not the PSP system should be
 * suspended due to critically low remaining battery capacity.
 */

#include <common_imp.h>
#include <interruptman.h>
#include <loadexec_kernel.h>
#include <power_kernel.h>
#include <syscon.h>
#include <sysmem_sysclib.h>
#include <sysmem_sysevent.h>
#include <threadman_kernel.h>

#include "power_int.h"


#define POWER_BATTERY_WORKER_THREAD_PRIO            64

/*
 * This value is sepcified for the [batteryAvailabilityStatus] member of ScePowerBattery.
 * It represents the current availability status of the battery in the power service.
 */
typedef enum {
    /* No battery is equipped or the power service cannot communicate with the equipped battery. */
    BATTERY_AVAILABILITY_STATUS_BATTERY_NOT_INSTALLED = 0,
    /* The power service is busy getting new battery information after a battery/power state change. */
    BATTERY_AVAILABILITY_STATUS_BATTERY_IS_BEING_DETECTED,
    /* A battery is correctly equipped and its properties (reamining battery life, charging state,...) can be obtained by API. */
    BATTERY_AVAILABILITY_STATUS_BATTERY_AVAILABLE,
} ScePowerBatteryAvailabilityStatus;

/* ScePowerBattery.sysconCmdDisableUsbChargingExecStatus */

#define BATTERY_SYSCON_CMD_DISABLE_USB_CHARGING_EXEC_STATUS_READY    0 /* The command can be executed. */
#define BATTERY_SYSCON_CMD_DISABLE_USB_CHARGING_EXEC_STATUS_BUSY     1 /* The command is currently being executed by SYSCON. */
#define BATTERY_SYSCON_CMD_DISABLE_USB_CHARGING_EXEC_STATUS_DONE     2 /* SYSCON has finished executing the command. */

/* Action flags for the battery worker thread. */

#define BATTERY_EVENT_FORBID_BATTERY_CHARGING                               0x00000100 /* Forbid battery charging. */
#define BATTERY_EVENT_PERMIT_BATTERY_CHARGING                               0x00000200 /* Permit battery charging. */
#define BATTERY_EVENT_UNKNOWN_400                                           0x00000400 /* Unknown. Something to do with disabling USB charging. */
#define BATTERY_EVENT_ENABLE_USB_CHARGING                                   0x00000800 /* Enable USB charging. */
#define BATTERY_EVENT_UPDATE_BATTERY_INFO                                   0x10000000 /* Update the battery control block (remainCap, voltage, temperature,...). */
#define BATTERY_EVENT_RESUME_BATTERY_POLLING_AND_USB_CHARGE_MANAGEMENT      0x20000000 /* Suspend polling the battery for data and USB charge management. */
#define BATTERY_EVENT_SUSPEND_BATTERY_POLLING_AND_USB_CHARGE_MANAGEMENT     0x40000000 /* Resume polling the battery for data and USB charge management. */
#define BATTERY_EVENT_TERMINATION                                           0x80000000 /* Terminate the battery event thread. */

/* Defines the different battery info update operations of the battery worker thread. */
typedef enum {
    POWER_BATTERY_THREAD_OP_START = 0,
    POWER_BATTERY_THREAD_OP_SET_POWER_SUPPLY_STATUS = 1,
    POWER_BATTERY_THREAD_OP_SET_IS_BATTERY_CHARGING_USB = 3,
    POWER_BATTERY_THREAD_OP_SET_USB_STATUS = 4,
    POWER_BATTERY_THREAD_OP_SET_REMAIN_CAP = 5,
    POWER_BATTERY_THREAD_OP_SET_FULL_CAP = 6,
    POWER_BATTERY_THREAD_OP_SET_CHARGE_CYCLE = 7,
    POWER_BATTERY_THREAD_OP_SET_LIMIT_TIME = 8,
    POWER_BATTERY_THREAD_OP_SET_BATT_TEMP = 9,
    POWER_BATTERY_THREAD_OP_SET_BATT_ELEC = 10,
    POWER_BATTERY_THREAD_OP_SET_BATT_VOLT = 11,
} PowerBatteryThreadOperation;

typedef struct {
    u32 unk0;
    u8 unk4;
    u8 unk5;
    u8 unk6;
    u8 unk7;
} ScePowerSysconSetParamDataTTC; // size: 8

/*
 * This structure represents the power service's internal control block for battery management.
 */
typedef struct  {
    SceUID batteryEventFlagId; // 0
    SceUID workerThreadId; // 4
    /* The battery capacity threshold value in mAh at which point the PSP system is automatically suspended. */
    s32 forceSuspendCapacity; // 8
    /*
     * The battery capacity threshold value in mAh at which point the remaining battery lifetime is considered
     * to be short.
     */
    s32 lowBatteryCapacity; // 12
    /*
     * Indicates whether the battery manager is set up to consistently poll the battery for new
     * data (temperatur, remaining capacity,...) and can enable/disable USB charging. For example,
     * if the PSP system enters the suspended power state, the battery manager won't poll (repeatedly)
     * for new battery data.
     */
    u32 isBatteryPollingAndUsbManagementSuspended; // 16
    /* 
     * Represents the total number of [forbid battery charge] requests minus the total number of 
     * [permit battery charge] requests (since cold boot). Consequently, if this number is greather 
     * than 0, there have been more [forbid battery charge] requests than [permit battery charge] requests. 
     * 
     * Note: "0" is its minimum (we do not "ignore" [forbid battery charge] requests).
     */
    u32 batteryForbidChargingNetCounter; // 20
    /* Indicates whether or not battery charging over USB is supported. */
    u32 isUsbChargingSupported; // 24
    /* Indicates whether or not battery charging over USB is currently enabled. */
    u32 isUsbChargingEnabled; // 28
    u32 unk32; // 32 -- TODO: A boolean flag dealing with USB charging.
    SceUID permitChargingDelayAlarmId; // 36
    /* Indicates whether or not the battery is currently charging. */
    u32 isBatteryCharging; // 40
    /* The type of the battery. One of ::ScePowerBatteryType. */
    u32 batteryType; // 44
    /*
     * Indicates whether or not the battery manager is currently polling the battery for data
     * (like remaining capacity, battery temperature or voltage).
     */
    u32 isBatteryInfoUpdateInProgress; // 48
    PowerBatteryThreadOperation workerThreadNextOp; // 52
    /*
     * Indicates whether or not the PSP device is currently connected to an external power source
     * via an AC adapter.
     */
    u32 isAcSupplied; // 56
    /* The current power supply status of the PSP system. */
    u32 powerSupplyStatus; // 60 
    /* The current availibilty status of the battery to the power service. One of ::ScePowerBatteryAvailabilityStatus. */
    u32 batteryAvailabilityStatus; // 64
    /* Unknown. */
    u32 batteryStatus; // 68
    /* The current remaining capacity of the battery in mAh. */
    s32 batteryRemainingCapacity; // 72
    /* The current remaining percentage of battery life relative to a fully charged status. */
    s32 batteryLifePercentage; // 76
    /* The full capacity of the battery in mAh. */
    s32 batteryFullCapacity; // 80
    /*
     * Represents the minimum full capacity of a battery. The full capacity of a battery can only be
     * accurately determined with a full charge (where the charge is cutoff at the end of the chargin process).
     * As such, the actual full capacity of a battery might not always be corectly available. In some cases
     * (such as swapping a battery?) the last reported full capacity might be less than the actual full capacity.
     * The [minimumFullCapacity] is thus used to provide a more accurate full capacity value until the battery
     * equipped has been fully charged again and a new full capacity could be ascertained.
     * 
     * The minimum full capacity is determined by initializing it to the current remaining battery capacity on PSP
     * startup and and then update it to the new reaming capacity value whenever that value is a new maximum
     * during the the use of the PSP system between two cold reboots. For example, this is the case when the battery
     * is being charged when the PSP system is turned on.
     */
    s32 minimumFullCapacity; // 84
    /* The current battery charge cycle count. */
    s32 batteryChargeCycle; // 88
    /*
     * Represents the remaining available minutes of use to the user of the PSP system. If this member
     * is set to a valid value, it will be considered in the calculation of the remaining battery lifetime.
     */
    s32 limitTime; // 92
    /* The current battery temperature in degree Celsius. */
    s32 batteryTemp; // 96
    /* The current electric charge value of the battery. */
    s32 batteryElec; // 100
    /* The current battery voltage in mV. */
    s32 batteryVoltage; // 104
    u32 sysconCmdDisableUsbChargingExecStatus; // 108
    SceSysconPacket powerBatterySysconPacket; // 112
    ScePowerSysconSetParamDataTTC ttcConfig;
} ScePowerBattery; //size: 216

static s32 _scePowerBatteryThread(SceSize args, void *argp);
static inline void _scePowerBatteryThreadErrorObtainBattInfo();
static s32 _scePowerBatteryCalcRivisedRcap(void); // 0x00005130
static s32 _scePowerBatteryConvertVoltToRCap(s32 voltage); // 0x00005130
static s32 _scePowerBatterySetTTC(s32 arg0); // 0x000056A4
static SceUInt _scePowerBatteryDelayedPermitCharging(void* common); // 0x00005EA4
static s32 _scePowerBatterySysconCmdIntr(SceSysconPacket* pSysconPacket, void* param); // 0x00005ED8

ScePowerBattery g_Battery; //0x0000C5B8

// Subroutine sub_00005B1C - Address 0x00005B1C
/* Initialize power service's internal batter manager. */
s32 _scePowerBatteryInit(u32 isUsbChargingSupported, u32 batteryType)
{
    memset(&g_Battery, 0, sizeof(ScePowerBattery)); // 0x00005B50

    g_Battery.permitChargingDelayAlarmId = -1; // 0x00005B74
