#include "../global.h"

#define IS_JUMP(op) ((op & 0xFC000000) == 0x0C000000)
#define JUMP(ref, addr) ((ref & 0xF0000000) | ((addr & 0x03FFFFFFF) << 2))

// 21F8
char g_pspbtcnfPath[] = "/kd/pspbtcnf.txt";

char g_220C[] = "SceInitFileName";
char g_221C[] = "SceInitUserParam";
char g_2230[] = "SceInitVSHParam";
char g_2240[] = "SceInitParamsfo";
char g_2250[] = "SceInitDiscImage";

char g_2294[] = "InitThreadEntry";

char g_22A4[] = "backup area";

typedef struct
{
    char *game;
    int **strcpy256;
    int numStrcpy256;
    int **wcscpy256;
    int numWcscpy256;
} SceJumpFixup;

int *g_2840[] = {(int*)0x089C07AC};
int *g_2844[] = {(int*)0x0888EA48, (int*)0x0888EA84, (int*)0x0888EAB4, (int*)0x0888EAF0, (int*)0x0888EB20, (int*)0x0888EB88, (int*)0x0888EBB8};
int *g_2860[] = {(int*)0x089C08F0};
int *g_2864[] = {(int*)0x0888EA40, (int*)0x0888EA7C, (int*)0x0888EAAC, (int*)0x0888EAE8, (int*)0x0888EB18, (int*)0x0888EB80, (int*)0x0888EBB0};
int *g_2880[] = {(int*)0x089C0928};
int *g_2884[] = {(int*)0x0888EA48, (int*)0x0888EA84, (int*)0x0888EAB4, (int*)0x0888EAF0, (int*)0x0888EB20, (int*)0x0888EB88, (int*)0x0888EBB8};

char g_ULUS10141[] = "ULUS10141";
char g_ULES00557[] = "ULES00557";
char g_ULES00558[] = "ULES00558";
char g_ULES00559[] = "ULES00559";
char g_ULES00560[] = "ULES00560";
char g_ULES00561[] = "ULES00561";
char g_ULES00562[] = "ULES00562";
char g_ULAS42082[] = "ULAS42082";
char g_ULKS46066[] = "ULKS46066";
char g_ULJM05213[] = "ULJM05213";

// 22E4
SceJumpFixup jumpFixups[] =
{
    {g_ULUS10141, g_2840, 1, g_2844, 7},
    {g_ULES00557, g_2840, 1, g_2844, 1},
    {g_ULES00558, g_2840, 1, g_2844, 1},
    {g_ULES00559, g_2840, 1, g_2844, 1},
    {g_ULES00560, g_2840, 1, g_2844, 1},
    {g_ULES00561, g_2840, 1, g_2844, 1},
    {g_ULES00562, g_2840, 1, g_2844, 1},
    {g_ULAS42082, g_2880, 1, g_2884, 1},
    {g_ULKS46066, g_2880, 1, g_2884, 1},
    {g_ULJM05213, g_2860, 1, g_2864, 1}
};

typedef struct
{
    int unk_0; // module filename?
    void *buf; // module buffer?
    int size; // PRX size?
    int unk_12;
    int attr;
    int unk_20;
    int argSize;
    int argPartId;
} SceLoadCoreBootModuleInfo;

typedef struct
{
    int addr;
    int size; // 4
    int attr; // 8
    SceUID partId; // 12
    int unk_16;
    int unk_20;
    int unk_24;
} SceLoadCoreProtectInfo;

typedef struct
{ 
    int membase; // 0
    int memsize; // 4
    int loadedMods; // 8
    int numMods; // 12
    SceLoadCoreBootModuleInfo *mods; // 16
    int unk_20;
    char unk_24;
    char unk_25[3]; // ?
    int numProts; // 28
    SceLoadCoreProtectInfo *prots; // 32
    int modProtId;
    int modArgProtId; // 40
    int unk_44;
    int unk_48; // 48
    int unk_52;
    char *configfile; // 56
    int unk_60;
    // the following wasn't in UTOPIA's structure
    int unk_64;
    int unk_68;
    int unk_72;
    int unk_76;
} SceLoadCoreBootInfo;

typedef struct
{
    int addr;
    int size;
} SceResetVectorInfo;

typedef struct
{
    int type;
    int addr;
    int addr2;
    SceResetVectorInfo resetVectorInfo;
    int unk20;
    int hasCfgFile; // 24
    int unk28, unk32, unk...
} SceInit;

SceInit g_init; // 28A0

// -------------------------------

// 0000
/* 'bzero' two times. Used for "reset vector", sets a buffer to 0.
 *
 * buf: The buffer to empty.
 * param: size The size of the buffer.
 */
void bzero2(int *buf, int size)
{
    int *curBuf = buf;
    // 000C
    do
    {
        *(curBuf++) = 0;
    } while (buf + size != curBuf);
    // 0018 -> WTF?
    curBuf = buf;
    do
    {
        *(curBuf++) = 0;
    } while (buf + size != curBuf);
    BREAK(0);
}

// 0028
void strcpy256(char *dst, char *src)
{
    int i;
    for (i = 255; i >= 0; i--)
    {
        char c = (i == 0) ? '\0' : *dst;
        dst++;
        *src = c;
        if (c == '\0')
            break;
        src++;
    }
}

// 0054
void wcscpy256(short *dst, short *src)
{
    int i;
    for (i = 255; i >= 0; i--)
    {
        short c = (i == 0) ? '\0' : *dst;
        dst++;
        *src = c;
        if (c == '\0')
            break;
        src++;
    }
}

void sub_0080()
{
