/* Copyright (C) 2011, 2012 The uOFW team
   See the file COPYING for copying permission.
*/

#include "../global.h"

#include "../exceptionman/exceptionman.h"

#include "interruptman.h"

extern int sub_0038();
extern int sub_091C();
extern int sub_0A74();
extern int sub_3230();
extern int sub_0924();
extern int sub_0CF8();
extern int sub_0000();
extern int sub_3110();
extern int sub_3160();
// real name is memset but gcc always puts a warning about that
void *my_memset(void *dst, char c, int n);
void sub_2A40(int intrNum);

extern int sub_0CC0();
extern int sub_0864();
extern int sub_0ECC();
extern int sub_0EF8();
extern int sub_0F20();
extern int sub_0F58();
extern int sub_0FE4();
extern int sub_0FF0();
extern int sub_0F64();
extern int sub_0FA4();
extern int sub_0FF8();
extern int sub_1000();
extern int sub_1008();
extern int sub_0EC0();
extern int sub_1010();
int sceKernelCpuSuspendIntr();
void sceKernelCpuResumeIntr();
void sub_1030();
void sub_1050(int out[2]);
int sceKernelSuspendIntr(int arg0, int arg1);
void sub_2968(int intrNum);
void sub_29B0(int intrNum);
int sceKernelIsIntrContext();
int sceKernelRegisterIntrHandler(int intrNum, int arg1, void *func, int arg3, SceIntrHandler *handler);
int sceKernelEnableIntr(int intNum);

char intrMgrStr[] = "InterruptManager"; // 0x36F4
char **intrMgrStrPtr = (char**)&intrMgrStr; // 0x33E8

// 0x3458
PSP_MODULE_INFO("sceInterruptManager", 0x1007, 1, 9);

char heapName[] = "SceInterruptManager"; // 0x3778

int devkitVer = 0x06030710;

typedef struct CbMap
{
    struct CbMap *next;
    int unk1, unk2, unk3;
    int (*callbacks[64])(void);
} CbMap;

CbMap emptyMap = {NULL, 0, 0, 0, {}}; // 0x38D0

CbMap cbMap = // 0x37C0
{
    &emptyMap, 0, 0x00000100, 0x00000110,
    {
    sub_0CC0, sub_0CC0, sub_0864, sub_0CC0,
    sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0,
    sub_0ECC, sub_0EF8, sub_0F20, sub_0F58,
    sub_0FE4, sub_0FF0, sub_0F64, sub_0FA4,
    sub_0FF8, sub_1000, sub_1008, sub_0EC0,
    sub_1010, sub_0CC0, sub_0CC0, sub_0CC0,
    sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0,
    sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0,
    sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0,
    sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0,
    sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0,
    sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0,
    sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0,
    sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0,
    sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0,
    sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0
    }
};

int wut; // 0x3B80 -> ???

int globUnk[80]; // 0x57C0

typedef struct
{
    int grpsOpt[23]; // 0x5900 -> 0x595C
    char unused2; // 0x5960
    char opt2; // 0x5961
    char opt; // 0x5962   
    char unused3; // 0x5963
    int unkVar1; // 0x5964
    int unkVar2; // 0x5968
    int unused; // 0x596C
    int intrStack; // 0x5970
    int intrStackArg; // 0x5974
    int unkVar3; // 0x5978
    int unkVar4; // 0x597C
    Interrupt intr[68]; // 0x5980
    int subIntrMemoryPoolId; // 0x6A80
    int unk[2]; // 0x6A84 - 0x6A88
    int count; // 0x6A8C
    int compare; // 0x6A90
} InterruptInfo;

InterruptInfo intInfo; // 0x5900

int unkTab[4]; // 0x58F0

extern int mod_0400, mod_0468, mod_0E48, mod_0E50;

void InterruptManagerForKernel_077B9BEE()
{
    intInfo.unk[0] = 0;
    intInfo.unk[1] = 0;
}

void InterruptManagerForKernel_0F9D0289(int (*arg0)(), int (*arg1)())
{
    int oldIc = sceKernelCpuSuspendIntr();
    *(int*)(mod_0468) = 0x0C000000 + (((int)arg1 >> 2) & 0x3FFFFFF);
    CACHE(0x1A, mod_0468);
    CACHE(0x08, mod_0468);
    *(int*)(mod_0400) = 0x0C000000 + (((int)arg0 >> 2) & 0x3FFFFFF);
    CACHE(0x1A, mod_0400);
    CACHE(0x08, mod_0400);
    sceKernelCpuResumeIntr(oldIc);
}

int InterruptManagerForKernel_11981C80(int intrNum)
{
    int sp[2];
    if (intrNum >= 64)
        return 0x80020065;
    sub_1050(sp);
    return (sp[intrNum >> 5] >> (intrNum & 0x1F)) & 1;
}

// 298C261F
int UnSupportIntr(int intrNum)
{
    if (intrNum >= 64)
        return 0x80020065;
    int oldIntr = sceKernelCpuSuspendIntr();
    sceKernelSuspendIntr(intrNum, 0);
    Interrupt *intr = &intInfo.intr[intrNum];
