/* Copyright (C) 2011, 2012 The uOFW team
   See the file COPYING for copying permission.
*/

#include <common_imp.h>
#include <exceptionman.h>
#include <sysmem_kernel.h>
#include <sysmem_suspend_kernel.h>

#include <interruptman.h>

#include "end.h"
#include "interruptman.h"
#include "start.h"

SceResidentLibraryEntryTable intrEntry = {
    .libName = "InterruptManager",
    .version = {
        0x11,
        0
    },
    .attribute = 0x4000,
    .len = 4,
    .vStubCount = 0,
    .stubCount = 9,
    .entryTable = (void*)(s32[]) {
        0x5CB5A78B,
        0x7860E0DC,
        0x8A389411,
        0xCA04A2B9,
        0xD2E8363F,
        0xD61E6961,
        0xEEE43F47,
        0xFB8E22EC,
        0xFC4374B8,
        (s32)sceKernelSuspendSubIntr,
        (s32)sceKernelResumeSubIntr,
        (s32)sceKernelDisableSubIntr,
        (s32)sceKernelRegisterSubIntrHandler,
        (s32)QueryIntrHandlerInfoForUser,
        (s32)sceKernelReleaseSubIntrHandler,
        (s32)sceKernelRegisterUserSpaceIntrStack,
        (s32)sceKernelEnableSubIntr,
        (s32)sceKernelIsSubInterruptOccured
    },
    .unk16 = 0,
    .unk18 = 0,
    .unk19 = 0
};

// 0x3458
SCE_MODULE_INFO("sceInterruptManager", SCE_MODULE_KERNEL | SCE_MODULE_ATTR_CANT_STOP | SCE_MODULE_ATTR_EXCLUSIVE_LOAD |
                                       SCE_MODULE_ATTR_EXCLUSIVE_START, 1, 9);
SCE_MODULE_BOOTSTART("IntrManInit");
SCE_MODULE_REBOOT_BEFORE("IntrManTerminate");
SCE_SDK_VERSION(SDK_VERSION);

SceSyscallTable g_emptyTable = { // 0x3810
    .next = NULL,
    .seed = 0,
    .tableSize = 0,
    .funcTableSize = 0,
};

SceSyscallTable g_syscallTable = { // 0x3700
    .next = &g_emptyTable,
    .seed = 0,
    .tableSize = 0x00000100,
    .funcTableSize = 0x00000110,
    .syscalls = {
        sub_0CC0, sub_0CC0, sub_0864, sub_0CC0,
        sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0,
        sub_0ECC, sub_0EF8, sub_0F20, sub_0F58,
        sub_0FE4, sub_0FF0, sub_0F64, sub_0FA4,
        sub_0FF8, sub_1000, sub_1008, sub_0EC0,
        sub_1010, sub_0CC0, sub_0CC0, sub_0CC0,
        sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0,
        sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0,
        sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0,
        sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0,
        sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0,
        sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0,
        sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0,
        sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0,
        sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0,
        sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0
    }
};

s8 g_stackBottom[672]; // 0x3820?

s8 g_stackMiddle[7232]; // 0x3AC0

s8 g_stackTop[304]; // 0x5700

s8 g_syscCtx[16]; // 0x5830

typedef struct
{
    s32 grpsOpt[24]; // 0
    s8 unused2; // 96
    s8 opt2; // 97
    s8 opt; // 98
    s8 unused3; // 99
    MonitorCb monitorCbBefore; // 100
    MonitorCb monitorCbAfter; // 104
    s32 unused; // 108
    s32 intrStack; // 112
    s32 intrStackArg; // 116
    u32 clockCounterLo; // 120
    u32 clockCounterHi; // 124
    Interrupt intr[68]; // 128
    s32 subIntrMemoryPoolId; // 4088
    s32 intcState[2]; // 4092
    s32 count;
    s32 compare;
} InterruptInfo;

InterruptInfo intInfo; // 0x5840

s32 IntrManInit()
{
    dbg_init(1, FB_NONE, FAT_HARDWARE);
    dbg_printf("Called %s\n", __FUNCTION__);
    s32 oldIc = sceKernelCpuSuspendIntr();
    pspCop0CtrlSet(COP0_CTRL_IS_INTERRUPT, 0);
    pspCop0CtrlSet(COP0_CTRL_SP_KERNEL, (s32)g_stackTop);
    pspCop0CtrlSet(COP0_CTRL_SP_USER, 0);
    mymemset(&intInfo, 0, sizeof(InterruptInfo));
    intInfo.opt = 1;
    sub_1030();
    ReleaseContextHooks();
    // 1150
    s32 i;
    for (i = 67; i >= 0; i--) {
        intInfo.intr[i].u16 = -1;
        intInfo.intr[i].u20 = -1;
    }
    sceKernelRegisterExceptionHandler(EXCEP_INT, (void*)intrExcepHandler);
    sceKernelRegisterPriorityExceptionHandler(EXCEP_INT, 3, (void*)intrExcepHandler2);
    sceKernelRegisterExceptionHandler(EXCEP_SYS, (void*)syscallExcepHandler);
    sceKernelRegisterIntrHandler(67, 0, sub_0000, 0, 0);
    sceKernelRegisterSuspendHandler(29, SuspendIntc, 0);
    sceKernelRegisterResumeHandler(29, ResumeIntc, 0);
