/* Copyright (C) 2011, 2012 The uOFW team
   See the file COPYING for copying permission.
*/

#include "common.h"

#include "exceptionman.h"

#include "interruptman.h"
#include "end.h"
#include "start.h"

char intrMgrStr[] = "InterruptManager"; // 0x36F4
char **intrMgrStrPtr = (char**)&intrMgrStr; // 0x33E8

// 0x3458
PSP_MODULE_INFO("sceInterruptManager", 0x1007, 1, 9);
PSP_MODULE_BOOTSTART(IntrManInit);
PSP_MODULE_REBOOT_BEFORE(IntrManTerminate);
PSP_SDK_VERSION(0x06060010);

char heapName[] = "SceInterruptManager"; // 0x3778

CbMap emptyMap = {NULL, 0, 0, 0, {}}; // 0x38D0

CbMap cbMap = // 0x37C0
{
    &emptyMap, 0, 0x00000100, 0x00000110,
    {
    sub_0CC0, sub_0CC0, sub_0864, sub_0CC0,
    sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0,
    sub_0ECC, sub_0EF8, sub_0F20, sub_0F58,
    sub_0FE4, sub_0FF0, sub_0F64, sub_0FA4,
    sub_0FF8, sub_1000, sub_1008, sub_0EC0,
    sub_1010, sub_0CC0, sub_0CC0, sub_0CC0,
    sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0,
    sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0,
    sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0,
    sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0,
    sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0,
    sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0,
    sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0,
    sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0,
    sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0,
    sub_0CC0, sub_0CC0, sub_0CC0, sub_0CC0
    }
};

/* TODO: find what lays here [0x3818 - 0x3ABC] */

int wut; // 0x3AC0

/* TODO: find what lays here [0x3AC4 - 0x56FC] */

int g_sp; // 0x5700

/* TODO: find what lays here [0x5704 - 0x5840] */

typedef struct
{
    int grpsOpt[24]; // 0
    char unused2; // 96
    char opt2; // 97
    char opt; // 98
    char unused3; // 99
    MonitorCb monitorCbBefore; // 100
    MonitorCb monitorCbAfter; // 104
    int unused; // 108
    int intrStack; // 112
    int intrStackArg; // 116
    u32 clockCounterLo; // 120
    u32 clockCounterHi; // 124
    Interrupt intr[68]; // 128
    int subIntrMemoryPoolId; // 4088
    int intcState[2]; // 4092
    int count;
    int compare;
} InterruptInfo;

InterruptInfo intInfo; // 0x5840

int IntrManInit()
{
    int oldIc = sceKernelCpuSuspendIntr();
    pspCop0CtrlSet(COP0_CTRL_IS_INTERRUPT, 0);
    pspCop0CtrlSet(COP0_CTRL_SP_KERNEL, (int)globUnk);
    pspCop0CtrlSet(COP0_CTRL_SP_USER, 0);
    mymemset(&intInfo, 0, sizeof(InterruptInfo));
    intInfo.opt = 1;
    sub_1030();
    ReleaseContextHooks();
    // 1150
    int i;
    for (i = 67; i >= 0; i--) {
        intInfo.intr[i].u16 = -1;
        intInfo.intr[i].u20 = -1;
    }
    sceKernelRegisterExceptionHandler(EXCEP_INT, (void*)sub_0038);
    sceKernelRegisterPriorityExceptionHandler(EXCEP_INT, 3, (void*)sub_0924);
    sceKernelRegisterExceptionHandler(EXCEP_SYS, (void*)sub_0CF8);
    sceKernelRegisterIntrHandler(67, 0, sub_0000, 0, 0);
    sceKernelRegisterSuspendHandler(29, SuspendIntc, 0);
    sceKernelRegisterResumeHandler(29, ResumeIntc, 0);
    sceKernelSetIntrLogging(67, 0);
