/* Copyright (C) 2011, 2012 The uOFW team
   See the file COPYING for copying permission.
*/

#include <common.h>

#include <interruptman.h>
#include <lowio_gpio.h>
#include <lowio_sysreg.h>
#include <sysmem_kdebug.h>
#include <sysmem_sysclib.h>
#include <sysmem_sysevent.h>
#include <sysmem_utils_kernel.h>
#include <threadman_kernel.h>

#include <syscon.h>

#include "syscon.h"

SCE_MODULE_INFO("sceSYSCON_Driver", SCE_MODULE_KERNEL | SCE_MODULE_SINGLE_START | SCE_MODULE_SINGLE_LOAD | SCE_MODULE_NO_STOP, 1, 11);
SCE_MODULE_BOOTSTART("_sceSysconModuleStart");
SCE_MODULE_REBOOT_BEFORE("_sceSysconModuleRebootBefore");
SCE_SDK_VERSION(SDK_VERSION);

typedef struct {
    SceSysconFunc func;
    s32 gp;
    void *argp;
} SceSysconCallback;

typedef enum {
    SYSCON_CB_LOW_BATTERY,
    SYSCON_CB_POWER_SWITCH,
    SYSCON_CB_ALARM,
    SYSCON_CB_AC_SUPPLY,
    SYSCON_CB_HP_CONNECT,
    SYSCON_CB_WLAN_SWITCH,
    SYSCON_CB_HOLD_SWITCH,
    SYSCON_CB_UMD_SWITCH,
    SYSCON_CB_HR_POWER,
    SYSCON_CB_WLAN_POWER,
    SYSCON_CB_GSENSOR,
    UNUSED,
    SYSCON_CB_BT_POWER,
    SYSCON_CB_BT_SWITCH,
    SYSCON_CB_HR_WAKEUP,
    SYSCON_CB_AC_SUPPLY2,
    SYSCON_CB_HR_UNK16,
    SYSCON_CB_HR_UNK17,
    SYSCON_CB_UNK18,
    SYSCON_CB_USB_UNK19,
    SYSCON_CB_COUNT
} SceSysconCallbacks;

/* structure at 0x4EB0; size: 384 */
typedef struct {
    SceSysconPacket *curPacket; // 0
    SceSysconPacket *packetList[8]; // 4
    SceSysconDebugHandlers *dbgHandlers; // 36
    u32 startTime; // 40
    u32 inGpioIntr; // 44
    u32 rebooted; // 48
    s32 packetOff; // 52
    u32 packetStartTimeout; // 56
    u32 packetStartTimeoutIntr; // 60
    s8 hpConnect; // 64
    s8 wlanSwitch; // 65
    s8 btSwitch; // 66
    s8 holdSwitch; // 67
    s8 umdSwitch; // 68
    s8 hrWakeupStatus; // 69
    s8 unk70; // 70
    s8 unk71; // 71
    s8 unk72; // 72
    s8 unk73; // 73
    s8 leptonPower; // 74
    s8 msPower; // 75
    s8 wlanPower; // 76
    s8 hddPower; // 77
    s8 dvePower; // 78
    s8 btPower; // 79
    s8 usbPower; // 80
    s8 tachyonVmePower; // 81
    s8 tachyonAwPower; // 82
    s8 tachyonAvcPower; // 83
    s8 lcdPower; // 84
    s8 hrPower; // 85
    s8 wlanLed; // 86
    s8 wlanOverride; // 87
    s8 btOverride; // 88
    u8 baryonStatus; // 89
    u8 hr; // 90
    u8 baryonStatus2; // 91
    SceSysconCallback callbacks[SYSCON_CB_COUNT]; // 92
    s32 baryonVersion; // 332
    s8 timeStampStr[16]; // 336
    /* Set to 1 if model is PSP 2k or newer. */
    s32 newModel; // 352
    s32 pommelVersion; // 356
    u64 timeStamp; // 360
    s32 pollingMode; // 368
    s32 retryMode; // 372
    s32 unk376; // 376
    SceUID semaId; // 380
} SceSyscon;

// 4E10
SceSysEventHandler g_SysconEv = { 64, (s8*)"SceSyscon", 0x00FFFF00, _sceSysconSysEventHandler, 0, 0, NULL, { 0, 0, 0, 0, 0, 0, 0, 0, 0 } };

// 4E50
SceSysconPacket g_GetStatus2Cmd;

SceSyscon g_Syscon;

// 0220
s32 _sceSysconModuleRebootBefore(void)
{
    dbg_printf("Run %s\n", __FUNCTION__);
    if (g_Syscon.unk376 != 0) {
        // 02A0
        sceSyscon_driver_765775EB(0);
    }
    g_Syscon.rebooted = 1;
    if (sceSysconCmdSync(NULL, 1)) {
        // 0274
        Kprintf("Syscon Cmd remained\n");
        // 0280
        while (sceSysconCmdSync(NULL, 1) != 0)
            sceKernelDelayThread(1000);
    }
    // 0258
    sceSysconEnd();
    return 0;
}

// 02B0
s32 sceSysconInit(void)
{
    dbg_printf("Run %s\n", __FUNCTION__);
    sceSysregSpiClkSelect(0, 1);
    sceSysregSpiClkEnable(0);
    sceSysregSpiIoEnable(0);
    HW(0xBE580000) = 0xCF;
    HW(0xBE580004) = 4;
    HW(0xBE580014) = 0;
    HW(0xBE580024) = 0;
