#include "reboot.h"

#define PSP_TYPE_SYSMEM 0
#define PSP_TYPE_LOADCORE 1

Callback1 callback1 = NULL; // 0x886128C8
Callback2 callback2 = NULL; // 0x886128CC
Callback3 callback3 = NULL; // 0x886128D0
Callback4 callback4 = NULL; // 0x886128D4
Callback5 callback5 = NULL; // 0x886128D8
int unkVar = 0; //0x886128DC

typedef struct
{
    int u0, u4, u8, u12, u16;
    int u20, u24, u28, u32, u36;
    int (*runCallback)(int, int); // 40
    int u44, u48, u52, u56;
    int u60, u64, u68, u72, u76;
    int u80, u84, u88, u92, u96;
    int u100, u104, u108, u112, u116, u120;
    int u124, u128, u132, u136, u140, u144;
    int u148, u152, u156, u160, u164, u168;
    int u172, u176, u180, u184, u188;
} ElfInfo;
ElfInfo moduleInfos[2]; // 0x886132B0

// 544C
int loadModule(int arg0, int type, int arg2) // type: 0 = sysmem, 1 = loadcore
{
    ElfInfo info = moduleInfos[type];
    int sp[12];
    int ptr = *(int*)(void*)(arg0 + 16) + type * 32;
    memset(&info, 0, sizeof(info));
    info.u100 = 1;
    info.u36 = *(int*)(ptr + 12);
    info.u8 = 0;
    int ret = sub_5C7C(*(int*)(ptr + 4), &info, type, arg2);
    if (ret < 0)
    {
        // 55F0
        int ptr = resetVectorInfo;
        if (*(int*)(ptr + 4) > 0x2000000)
            *(int*)(0xBC100040) = (*(int*)(0xBC100040) & 0xFFFFFFFC) | 2;
        else
            *(int*)(0xBC100040) = (*(int*)(0xBC100040) & 0xFFFFFFFC) | 1;
        memset((void*)0xBFC00000, 0, 0x1000);
        memcpy((void*)0xBFC00000, &sub_1810, sizeof(sub_1810)); // NOTE: original uses 0x88601838 - 0x88601810 for size
        resetVectorAddr = 0xBFC00000;
        int (*resetVector)(int, int) = 0xBFC00000;
        resetVector(*(int*)(ptr + 0), *(int*)(ptr + 4));
        for (;;)
            ;
    }
    memset(*(int*)(ptr + 4), 0, *(int*)(ptr + 8));
    if (type == PSP_TYPE_LOADCORE)
    {
        // 5598
        *(int*)(arg2 + 64) = info.u120;
        *(int*)(arg2 + 68) = info.u124;
        *(int*)(arg2 + 80) = &moduleInfos[1];
        *(int*)(arg2 + 100) = sub_0DE4;
        *(int*)(arg2 + 104) = sub_15C4;
        *(int*)(arg2 + 92) = sub_1730;
        *(int*)(arg2 + 84) = sub_17E8;
        *(int*)(arg2 + 88) = sub_17FC;
        *(int*)(arg2 + 76) = &moduleInfos[0];
    }

    // 5504
    sub_0928();
    sub_01D4();
    *(int*)(arg0 + 8) = 2;
    if (type == PSP_TYPE_SYSMEM)
        info.runCallback(4, arg2);
    if (type == PSP_TYPE_LOADCORE)
    {
        // 5550
        sp[0] = arg0;
        sp[1] = arg2;
        pspKernelSetSp(*(int*)(arg2 + 72) - 64);
        return info.runCallback(8, sp);
    }
    return 0;
}

char unkString1[256]; // 0x88613430
char unkString2[256]; // 0x88613530

// 57C0
void applySegmentRelocs(int arg0, int arg1, int arg2, int arg3, int arg4)
{
    a0 = 1;
    s7 = 0;
    s6 = arg3 + arg4;
    s2 = 0;
    s1 = a1;
    s0 = 0;

    v1 = 0;
    // 5804
    do
    {
        v1++;
        t0 = a0 << (v1 & 0x1F);
        if (v1 >= 33)
            return 0x80020001;
    } while (t0 < a2);

    t6 = v1;

    t6 = v1;

    // 5828
    v1 = *(short*)(a3 + 0);
    if (v1 != 0)
        return 0x80020001;
    v1 = *(char*)(a3 + 4);
    t5 = *(char*)(a3 + 2);
    s3 = *(char*)(a3 + 3);
    t8 = v1 & 0xFF;
    a3 += 4;
    a1 = unkString2;
    a0 = 0;

    // 5864
    while (a0 < t8)
    {
        a0++;
        *(char*)a1 = v1;
        a3++;
        a1++;
        v1 = *(char*)a3;
    }

    // 5888
    t9 = v1 & 0xFF;
    a1 = unkString1;
    a0 = 0;

    // 589C
    while (a0 < t9)
    {
        a0++;
        *(char*)a1 = v1;
        a3++;
        a1++;
        v1 = *(char*)a3;
    }

    // 58BC
    t3 = a3 < s6;
    s5 = t9;
    if (t3 == 0)
        return 0;
    s4 = -t5;

    // 58CC
    do
    {
        t0 = *(short*)a3;
        t1 = 16;
        t2 = t1 - t5;
        v1 = t0 << t2;
        a1 = v1 & 0xFFFF;
        a0 = s4 + 16;
        t4 = a1 >> a0;
        v1 = t4 & 0xFFFF;
        t7 = v1 < t8;
        t4 = a3 + 2;
        if (t7 == 0)
            return 0x80020001;
        t3 = unkString2[v1]
        v1 = t3 & 1;
        a0 = t5 + t6;
        if (v1 == 0)
        {
            // 5C28
            s0 = t1 - a0;
            v1 = t0 << (s0 & 0x1F);
            t7 = t5 - a0;
            s2 = v1 & 0xFFFF;
            t2 = t7 + 16;
            a1 = s2 >> (t2 & 0x1F);
            s2 = a1 & 0xFFFF;
            s0 = s2 < a2;
            if (s0 == 0)
                return 0x80020001;
            v1 = t3 & 6;
            s0 = t0 >> (a0 & 0x1F);
            if (v1 != 0)
            {
                t0 = 4;
                if (v1 != t0)
                    return 0x80020001;
                s0 = *(int*)t4; // unaligned reading
                t4 = a3 + 6;
            }
        }
        else
        {
            t7 = 1;
            a0 = t6 + t5;
            if (v1 != 1)
                return 0x80020001;
            t2 = a0 + s3;
            v0 = t1 - t2;
            t7 = t0 << (v0 & 0x1F);
            a1 = a0 - t2;
            t2 = t7 & 0xFFFF;
            t7 = a1 + 16;
            a1 = t2 << t7;
            t2 = a1 & 0xFFFF;
            t7 = t2 < t9;
            if (t7 == 0)
                return 0x80020001;
            t7 = t1 - a0;
            v1 = t0 << t7;
            a1 = t5 - a0;
            t7 = v1 & 0xFFFF;
            a0 = a1 + 16;
            a1 = t7 >> a0;
            a0 = s2 < a2;
            t7 = a1 & 0xFFFF;
            if (a0 == 0)
                return 0x80020001;
            a0 = t7 < a2;
            if (a0 != 0)
                return 0x80020001;
            v1 = t3 & 6;
            a1 = 2;
            t2 = unkString1[t2];
            if (v1 == a1)
            {
                v0 = s3 + t6;
                // 5BF8
                a0 = v0 + t5;
                v1 = a0 - t1;
                t1 = v1 + 16;
                t4 = *(short*)(a3 + 2);
                a1 = t0 >> (t1 & 0x1F);
                v1 = a1 << 16;
                t0 = v1 | t4;
                t1 = t0 << (a0 & 0x1F);
                t4 = t1 >> (a0 & 0x1F);
                s0 += t4;
                t4 = a3 + 4;
            }
            else if (v1 >= 3)
            {
                s0 = 4;
                // 5BE0
                if (v1 != s0)
                    return 0x80020001;
                s0 = *(int*)t4; // unaligned reading
                t4 = a3 + 6;
            }
            else
            {
                a0 = t0 << 16;
                if (v1 != 0)
                    return 0x80020001;
                a1 = s3 + t6;
                v1 = a1 + t5;
                t0 = v1 + 16;
                a3 = a0 >> t0;
                s0 += a3;
            }
        
            // 59D4
            t0 = s2 << 2;
            a1 = t0 + s1;
            a0 = *(int*)(a1 + 32);
            a3 = s0 < a0;
            if (a3 == 0)
                return 0x80020001;
            v1 = t3 & 0x38;
            t3 = 8;
            if (v1 == t3)
            {
                v1 = s5 ^ 0x6;
                // 5BD0
                if (v1 != 0)
                    s7 = 0;
            }
            else
            {
                s5 = v1 < 9;
                s7 = 16;
                if (s5 == 0)
                {
                    // 5BA4
                    if (v1 != s7)
                    {
                        // 5BB8
                        if (v1 == 24)
                            s7 = *(int*)t4; // unaligned reading
                        return 0x80020001;
                    }
                    s7 = *(short*)t4;
                    t4 += 2;
                }
                else
                {
                    s7 = 0;
                    if (v1 != 0)
                        return 0x80020001;
                }
            }
        
            a0 = t0 + s1;
            // 5A18
            t1 = *(int*)(a0 + 16);
            a3 = t7 << 2;
            a1 = a3 + s1;
            t7 = t2 < 8;
            a3 = s0 + t1;
            t1 = *(int*)(a1 + 0);
        
            if (t2 >= 8)
                return 0x80020001;
        
            switch (t2)
            {
            case 0:
                // 5A68
                break;
        
            case 1:
                // 5AA8
                a1 = *(int*)a3; // unaligned reading
                a0 = t0 + s1;
                s5 = *(int*)a0;
                t0 = a1;
                t0 &= 0x3F;
                v0 = s0 + s5;
                v0 &= 0xF0000000;
                t3 = t0 << 2;
                t7 = t3 | v0;
                v1 = t7 + t1;
                v0 = (v1 >> 2) & 0x3FFFFFF;
                a1 &= 0xFC000000;
                v0 |= a1;
                *(int*)a3 = v0; // unaligned writing
                break;
        
            case 2:
                // 5AE4
                v1 = *(int*)a3; // unaligned reading
                a0 = t0 + s1;
                t0 = *(int*)a0;
                v1 &= 0x3F;
                t3 = v1 << 2;
                s5 = s0 + t0;
                s5 &= 0xF0000000;
                t7 = t3 | s5;
                a1 = t7 + t1;
                v0 = (a1 >> 2) & 0x3FFFFFF;
                a1 = 0x8000000;
                v0 |= a1;
                *(int*)a3 = v0; // unaligned writing
                break;
        
            case 3:
                // 5B18
                v1 = *(int*)a3; // unaligned reading
                a0 = t0 + s1;
                s5 = *(int*)a0;
                v1 &= 0x3F;
                t3 = v1 << 2;
                v0 = s0 + s5;
                v0 &= 0xF0000000;
                t7 = t3 | v0;
                a1 = t7 + t1;
                v0 = (a1 >> 2) & 0x3FFFFFF;
                a1 = 0xC000000;
                v0 |= a1;
                *(int*)a3 = v0; // unaligned writing
                break;
        
            case 4:
            case 7:
                // 5B80
                a1 = *(int*)a3; // unaligned reading
                v0 = (int)(a1 & 0xFFFF);
                a0 = t1 + v0;
                v0 = a0 & 0xFFFF;
                a1 &= 0xFFFF0000;
                v0 |= a1;
                *(int*)a3 = v0; // unaligned writing
                break;
        
            case 5:
                // 5A54
                *(int*)a3 += t1; // unaligned RW
                break;
        
            case 6:
                // 5B4C
                t0 = *(int*)a3; // unaligned reading
                t3 = t0 << 16;
                s5 = (int)(s7 & 0xFFFF);
                t7 = t3 + s5;
                v1 = t7 + t1;
                t1 = v1 >> 15;
                a1 = t1 + 1;
                v0 = (a1 >> 1) & 0x3FFFFFF;
                a1 = *(int*)a3; // unaligned reading
                a1 &= 0xFFFF0000;
                v0 |= a1;
                *(int*)a3 = v0; // unaligned writing
                break;
            }
        
            s5 = t2;
        }
        // 5A6C
        a3 = t4;
    } while (t4 < s6);
    return 0;
}

int sub_5C7C(int arg0, int arg1, int arg2, int arg3) // arg1: ELF buffer
{   
    if ((arg0 == 0) || (arg1 == 0)
     || (arg3 == 0) || (arg2 >> 31)
     || (arg2 >= 2))
        return 0x800200D2;

    *(arg1 + 28) = arg0;
    // 5CF4
    v0 = sub_6014(arg1);
    if (v0 < 0)
        return v0;
    s3 = sub_6284(arg1, arg2); // Get ELF memory size
    v0 = sub_60FC(arg1, sp + 64);
    if (v0 < 0)
        return v0;
    sub_6350(arg1, s3, arg2, arg3);
    if (v0 < 0)
        return v0;
    v0 = sub_6428(arg1);
    if (v0 < 0)
        return v0;
    v0 = sub_653C(arg1);
    if (v0 < 0)
        return v0;
    v0 = applyRelocs(arg1, sp); // Apply relocations
    if (v0 < 0)
        return v0;
    t3 = 0;
    t0 = *(int*)(arg1 + 28);
    t1 = *(int*)(arg1 + 132);
    v1 = *(int*)(t0 + 28);
    s3 = (t1 << 5) + t0 + v1;                                                                                                                                       
    v1 = s3 - 32;                                                                                                                                                   
    a1 = *(int*)(v1 + 20);
    a0 = *(int*)(v1 + 16);
    t2 = 0;
    if (a0 < a1)
    {
        t2 = a1 - a0;
        a1 = *(int*)(arg1 + 36) + *(int*)(v1 + 8);
        t3 = a1 + a0;
    }
    // 5DB0
    t0 = 0;
    if (t1 != 0)
    {
        a3 = sp;

        // 5DBC
        do
        {
            a1 = *(int*)(a3 + 16);
            a2 = *(int*)(a3 + 0);
            v1 = *(int*)(a3 + 32);
            if (a2 != a1)
            {
                s3 = v1;
                if (a2 >= a1)
                {
                    // 5EC4
                    s3 &= 0xFFFFFFFC;
                    a0 = a1 + s3;
                    a2 += s3;
                    // 5ED8
                    while (a1 < a0)
                    {                                                                                                                                             
                        a0 -= 4;
                        t9 = *(int*)a0;
                        a2 -= 4;
                        *(int*)a2 = t9;
                    }
                }
                else
                {
                    v1 &= 0xFFFFFFFC;
                    a0 = a1 + v1;
                    // 5DEC
                    while (a1 < a0)
                    {
                        t6 = *(int*)a1;
                        a1 += 4;
                        *(int*)a2 = t6;
                        a2 += 4;
                    }
                }
            }

            // (5E04)
            t0++;
            // 5E08
            a3 += 4;
        } while (t0 < t1);
    }

    // 5E14
    a3 = t3 & 3;
    if (t2 != 0)
    {
        a0 = t3;
        v1 = t2;
        if (a3 != 0)
        {
            // 5E28
            do
            {
                *(char*)a0 = 0;
                a0++;
                t1 = a0 & 3;
                v1--;
            } while (t1 != 0);
        }

        // 5E3C
        t2 = v1 + 3;
        v1 = t2 >> 2;
        v0 = a0;
        // 5E4C
        while (v1 != 0)
        {
            v1--;
            *(int*)v0 = 0;
            v0 += 4;
        }
    }

    // 5E5C
    if (arg2 == 0)
        return 0;
    if (*(int*)(arg1 + 84) == 0)
        return 0;
    a2 = *(int*)(arg1 + 48) - *(int*)(arg1 + 20);
    a0 = a2 + 0xFF;
    if (a2 > 0)
        a2 = (a0 + (((a0 >> 31) == 1) ? 0xFF : 0)) & 0xFFFFFF00;

    // 5E94
    v0 = *(arg3 + 60)(*(int*)(arg1 + 24), 0);
    if (v0 < 0)
        return v0;
    *(int*)(arg1 + 20) = *(int*)(arg1 + 48);
    return 0;
}

int sub_5678(int arg0, int arg1)
{
    int v = -1;
    if (*(int*)arg0 != 0x5053507E)
        return -1;
    // 56D0
    s0 = arg0 + 208;
    sub_17FC((*(char*)(arg0 + 208) << 24) | (*(char*)(arg0 + 209) << 16) | (*(char*)(arg0 + 210) << 8) | *(char*)(arg0 + 211));
    if (callback2 != NULL && callback2(arg0, arg1) != 0)
        return -1;
    // 5728
    if (sub_17FC((*(char*)(arg0 + 208) << 24) | (*(char*)(arg0 + 209) << 16) | (*(char*)(arg0 + 210) << 8) | *(char*)(arg0 + 211)) == 0)
        return -1;
    if (callback3 == NULL)
        return 0x8002013A;
    if (callback3(0, 0xBFC00200) != 0)
        return -1;
    if (callback1 == NULL)
        return 0x8002013A;
    if (callback1(arg0, arg1, &v) != 0)
        return -1;
    return v;
}

int sub_5EF8(Callback1 arg)
{
    callback1 = arg;
    return 0;
}

int sub_5F08(Callback2 arg)
{
    callback2 = arg;
    return 0;
}

int sub_5F18(Callback3 arg)
{
    callback3 = arg;
    return 0;
}

int sub_5F28(Callback4 arg)
{
    callback4 = arg;
    return 0;
}

int sub_5F38(Callback5 arg)
{
    callback5 = arg;
    return 0;
}

int sub_5F48(int arg0, int arg1)
{
    if (callback2 == NULL)
        return -1;
    if (callback2(arg0, arg1) != 0)
        return -1;
    return 0;
}

/* ELF file header */
typedef struct
{
    char e_ident[16];          //  0
    Elf32_Half    e_type;      // 16
    Elf32_Half    e_machine;   // 18
    Elf32_Word    e_version;   // 20
    Elf32_Addr    e_entry;     // 24
    Elf32_Off     e_phoff;     // 28
    Elf32_Off     e_shoff;     // 32
    Elf32_Word    e_flags;     // 36
    Elf32_Half    e_ehsize;    // 40
    Elf32_Half    e_phentsize; // 42
    Elf32_Half    e_phnum;     // 44
    Elf32_Half    e_shentsize; // 46
    Elf32_Half    e_shnum;     // 48
    Elf32_Half    e_shstrndx;  // 50
} Elf32_Ehdr;

/* Segment header */
typedef struct
{
    Elf32_Word p_type;   //  0
    Elf32_Off  p_offset; //  4
    Elf32_Addr p_vaddr;  //  8
    Elf32_Addr p_paddr;  // 12
    Elf32_Word p_filesz; // 16
    Elf32_Word p_memsz;  // 20
    Elf32_Word p_flags;  // 24
    Elf32_Word p_align;  // 28
} Elf32_Phdr;

// 6014
int sub_6014(int arg)
{   
    *(int*)(arg + 72) = 0;
    int bufAddr = *(int*)(arg + 28);
    int header = *(int*)(bufAddr + 0);
    if (header == 0x4543537E) // ~SCE
        return 0x80020148;
    if (bufAddr & 0x3F != 0)
        return 0x80020148;
    if (header != 0x5053507E) // ~PSP
        return 0x80020148;
    if (*(int*)(bufAddr + 52) >= 0)
        return 0x80020148;
    if (*(char*)(bufAddr + 124) == 0)
        return 0x80020148;

    short unk = *(unsigned short*)(bufAddr + 6);
    if (unk != 0)
    {   
        if (unk & 0xE != 0)
            return 0x80020148;
        if (unk & 0xF0FE != 0)
            return 0x80020148;
        unk &= 0xF00;
        if (unk == 0)
            return 0x80020148;
        if (unk != 512)
            return 0x80020148;
    }
    
    // 60CC
    *(int*)(arg + 72) = 1;
    *(int*)(arg + 16) = *(int*)(bufAddr + 44);
    *(short*)(arg + 88) = *(short*)(bufAddr + 4);
