/* Copyright (C) 2011, 2012 The uOFW team
   See the file COPYING for copying permission.
*/

#include <common_imp.h>

#include "interruptman.h"
#include "lowio_sysreg.h"
#include "modulemgr_init.h"
#include "sysmem_kdebug.h"
#include "sysmem_kernel.h"
#include "sysmem_sysevent.h"
#include "sysmem_sysclib.h"
#include "sysmem_utils_kernel.h"
#include "threadman_kernel.h"

#include "ge.h"

SCE_MODULE_INFO("sceGE_Manager", SCE_MODULE_KERNEL | SCE_MODULE_ATTR_CANT_STOP | SCE_MODULE_ATTR_EXCLUSIVE_LOAD
                                 | SCE_MODULE_ATTR_EXCLUSIVE_START, 1, 11);
SCE_MODULE_BOOTSTART("_sceGeModuleStart");
SCE_MODULE_REBOOT_BEFORE("_sceGeModuleRebootBefore");
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wattribute-alias"
SCE_MODULE_REBOOT_PHASE("_sceGeModuleRebootPhase");
#pragma GCC diagnostic pop
SCE_SDK_VERSION(SDK_VERSION);

#define HW_GE_RESET     HW(0xBD400000)
#define HW_GE_EDRAMSIZE HW(0xBD400008)
#define HW_GE_DLIST     HW(0xBD400108)
#define HW_GE_STALLADDR HW(0xBD40010C)
#define HW_GE_CMD(i)    HW(0xBD400800 + i * 4)
#define HW_GE_BONES     ((vs32*)HWPTR(0xBD400C00))
#define HW_GE_BONE(i)   ((vs32*)HWPTR(0xBD400C00 + i * 48))
#define HW_GE_WORLDS    ((vs32*)HWPTR(0xBD400D80))
#define HW_GE_VIEWS     ((vs32*)HWPTR(0xBD400DB0))
#define HW_GE_PROJS     ((vs32*)HWPTR(0xBD400DE0))
#define HW_GE_TGENS     ((vs32*)HWPTR(0xBD400E20))

#define GE_SIGNAL_HANDLER_SUSPEND  0x01
#define GE_SIGNAL_HANDLER_CONTINUE 0x02

#define GE_SIGNAL_CALL             0x11
#define GE_SIGNAL_RET              0x12
#define GE_SIGNAL_RJUMP            0x13
#define GE_SIGNAL_RCALL            0x14
#define GE_SIGNAL_OJUMP            0x15
#define GE_SIGNAL_OCALL            0x16

#define GE_SIGNAL_RTBP0            0x20
#define GE_SIGNAL_RTBP1            0x21
#define GE_SIGNAL_RTBP2            0x22
#define GE_SIGNAL_RTBP3            0x23
#define GE_SIGNAL_RTBP4            0x24
#define GE_SIGNAL_RTBP5            0x25
#define GE_SIGNAL_RTBP6            0x26
#define GE_SIGNAL_RTBP7            0x27
#define GE_SIGNAL_OTBP0            0x28
#define GE_SIGNAL_OTBP1            0x29
#define GE_SIGNAL_OTBP2            0x2A
#define GE_SIGNAL_OTBP3            0x2B
#define GE_SIGNAL_OTBP4            0x2C
#define GE_SIGNAL_OTBP5            0x2D
#define GE_SIGNAL_OTBP6            0x2E
#define GE_SIGNAL_OTBP7            0x2F
#define GE_SIGNAL_RCBP             0x30
#define GE_SIGNAL_OCBP             0x38
#define GE_SIGNAL_BREAK1           0xF0
#define GE_SIGNAL_BREAK2           0xFF

#define GE_MAKE_OP(cmd, arg) (((cmd) << 24) | ((arg) & 0x00FFFFFF))
#define GE_VALID_ADDR(addr) ((int)(addr) >= 0 && \
         (ADDR_IS_SCRATCH(addr) || ADDR_IS_VRAM(addr) || ADDR_IS_RAM(addr)))

#define MAKE_SYSCALL(n)            (0x03FFFFFF & (((u32)(n) << 6) | 0x0000000C))
#define MAKE_JUMP(f)               (0x08000000 | ((u32)(f)  & 0x0FFFFFFC)) 
#define JR_RA                      (0x03E00008)
#define NOP                        (0)

/******************************/

int _sceGeReset();
int _sceGeInitCallback3(void *arg0, s32 arg1, void *arg2);
int _sceGeInitCallback4();
int _sceGeSetRegRadr1(int arg0);
int _sceGeSetRegRadr2(int arg0);
int _sceGeSetInternalReg(int type, int arg1, int arg2, int arg3);
int _sceGeInterrupt(int arg0, int arg1, int arg2);
s32 _sceGeSysEventHandler(s32 ev_id, char *ev_name, void *param, s32 *result);
int _sceGeModuleStart();
int _sceGeModuleRebootPhase(s32 arg0 __attribute__((unused)), void *arg1 __attribute__((unused)), s32 arg2 __attribute__((unused)), s32 arg3 __attribute__((unused)));
int _sceGeModuleRebootBefore(void *arg0 __attribute__((unused)), s32 arg1 __attribute__((unused)), s32 arg2 __attribute__((unused)), s32 arg3 __attribute__((unused)));
int _sceGeSetBaseRadr(int arg0, int arg1, int arg2);
int _sceGeEdramResume();
int _sceGeEdramSuspend();
int _sceGeQueueInit();
int _sceGeQueueSuspend();
int _sceGeQueueResume();
void _sceGeFinishInterrupt(int arg0, int arg1, int arg2);
void _sceGeListInterrupt(int arg0, int arg1, int arg2);
int sceGeDebugBreak();
int sceGeDebugContinue(int arg0);
int _sceGeQueueInitCallback();
int _sceGeQueueEnd();
int _sceGeQueueStatus(void);
void _sceGeErrorInterrupt(int arg0, int arg1, int arg2);
void _sceGeListError(u32 cmd, int err);
void _sceGeWriteBp(int *list);
void _sceGeClearBp();
void _sceGeListLazyFlush();
int _sceGeListEnQueue(void *list, void *stall, int cbid, SceGeListArgs * arg,
                      int head);

/****** Structures *********/

typedef struct {
    SceGeDisplayList *curRunning;
    int isBreak;
    SceGeDisplayList *active_first;  //  8
    SceGeDisplayList *active_last;   // 12
    SceGeDisplayList *free_first;    // 16
    SceGeDisplayList *free_last;     // 20
    SceUID drawingEvFlagId;     // 24
    SceUID listEvFlagIds[2];    // 28, 32
    SceGeStack stack[32];       // 36
    int sdkVer;                 // 1060
    int patched;                // 1064
    int syscallId;
    SceGeLazy *lazySyncData;
} SceGeQueue;

typedef struct {
    int unk0, unk4, unk8;
    int *unk12;
    int unk16, unk20, unk24, unk28;
} SceGeQueueSuspendInfo;

typedef struct {
    int unk0, unk4, unk8, unk12;
} SceGeBpCmd;

typedef struct {
    int busy;
    int clear;
    int size;
    int size2;
    SceGeBpCmd cmds[10];
} SceGeBpCtrl;

typedef struct {
    char *name;
    u32 *ptr;
} SadrUpdate;

typedef struct {
    char reg1;
    char cmd;
    char reg2;
    char size;
} SceGeMatrix;

/********* Global values *********/

// 6640
SceIntrCb g_GeSubIntrFunc = {
    0, 0, NULL, NULL,
    NULL, NULL, NULL, NULL,
    NULL, NULL, NULL
};

// 666C
SceIntrHandler g_GeIntrOpt = { 12, 0x00000020, &g_GeSubIntrFunc };

// 6678
SceKernelDeci2Ops g_Deci2Ops = { 0x3C,
    {
     (void *)sceGeGetReg,
     (void *)sceGeGetCmd,
     (void *)sceGeGetMtx,
     (void *)sceGeSetReg,
     (void *)sceGeSetCmd,
     (void *)sceGeSetMtx,
