/* Copyright (C) 2011, 2012 The uOFW team
   See the file COPYING for copying permission.
*/

#include <common_imp.h>

#include "interruptman.h"
#include "lowio_sysreg.h"
#include "modulemgr_init.h"
#include "sysmem_kdebug.h"
#include "sysmem_kernel.h"
#include "sysmem_sysevent.h"
#include "sysmem_sysclib.h"
#include "sysmem_utils_kernel.h"
#include "threadman_kernel.h"

#include "ge.h"

char *_dbg_cmds[256] = {
"NOP", // 0x00
"VADR", // 0x01
"IADR", // 0x02
"UNK03",
"PRIM", // 0x04
"BEZIER", // 0x05
"SPLINE", // 0x06
"BBOX", // 0x07
"JUMP", // 0x08
"BJUMP", // 0x09
"CALL", // 0x0A
"RET", // 0x0B
"END", // 0x0C
"UNK0D",
"SIGNAL", // 0x0E
"FINISH", // 0x0F
"BASE", // 0x10
"UNK11",
"VTYPE", // 0x12
"OFFSET", // 0x13
"ORIGIN", // 0x14
"REGION1", // 0x15
"REGION2", // 0x16
"LTE", // 0x17
"LE0", // 0x18
"LE1", // 0x19
"LE2", // 0x1A
"LE3", // 0x1B
"CLE", // 0x1C
"BCE", // 0x1D
"TME", // 0x1E
"FGE", // 0x1F
"DTE", // 0x20
"ABE", // 0x21
"ATE", // 0x22
"ZTE", // 0x23
"STE", // 0x24
"AAE", // 0x25
"PCE", // 0x26
"CTE", // 0x27
"LOE", // 0x28
"UNK29",
"BONEN", // 0x2A
"BONED", // 0x2B
"WEIGHT0", // 0x2C
"WEIGHT1", // 0x2D
"WEIGHT2", // 0x2E
"WEIGHT3", // 0x2F
"WEIGHT4", // 0x30
"WEIGHT5", // 0x31
"WEIGHT6", // 0x32
"WEIGHT7", // 0x33
"UNK34",
"UNK35",
"DIVIDE", // 0x36
"PPM", // 0x37
"PFACE", // 0x38
"UNK39",
"WORLDN", // 0x3A
"WORLDD", // 0x3B
"VIEWN", // 0x3C
"VIEWD", // 0x3D
"PROJN", // 0x3E
"PROJD", // 0x3F
"TGENN", // 0x40
"TGEND", // 0x41
"SX", // 0x42

#define GE_SIGNAL_OCALL            0x16

#define GE_SIGNAL_RTBP0            0x20
#define GE_SIGNAL_RTBP1            0x21
#define GE_SIGNAL_RTBP2            0x22
#define GE_SIGNAL_RTBP3            0x23
#define GE_SIGNAL_RTBP4            0x24
#define GE_SIGNAL_RTBP5            0x25
#define GE_SIGNAL_RTBP6            0x26
#define GE_SIGNAL_RTBP7            0x27
#define GE_SIGNAL_OTBP0            0x28
#define GE_SIGNAL_OTBP1            0x29
#define GE_SIGNAL_OTBP2            0x2A
#define GE_SIGNAL_OTBP3            0x2B
#define GE_SIGNAL_OTBP4            0x2C
#define GE_SIGNAL_OTBP5            0x2D
#define GE_SIGNAL_OTBP6            0x2E
#define GE_SIGNAL_OTBP7            0x2F
#define GE_SIGNAL_RCBP             0x30
#define GE_SIGNAL_OCBP             0x38
#define GE_SIGNAL_BREAK1           0xF0
#define GE_SIGNAL_BREAK2           0xFF

#define GE_MAKE_OP(cmd, arg) (((cmd) << 24) | ((arg) & 0x00FFFFFF))
#define GE_VALID_ADDR(addr) ((int)(addr) >= 0 && \
         (ADDR_IS_SCRATCH(addr) || ADDR_IS_VRAM(addr) || ADDR_IS_RAM(addr)))

#define MAKE_SYSCALL(n)            (0x03FFFFFF & (((u32)(n) << 6) | 0x0000000C))
#define MAKE_JUMP(f)               (0x08000000 | ((u32)(f)  & 0x0FFFFFFC)) 
#define JR_RA                      (0x03E00008)
#define NOP                        (0)

#define SCE_GE_INTERNAL_REG_BASE_ADDR 1
#define SCE_GE_INTERNAL_REG_RADR1 2
#define SCE_GE_INTERNAL_REG_RADR2 4

#define SCE_GE_INTSIG 1
#define SCE_GE_INTEND 2
#define SCE_GE_INTFIN 4
#define SCE_GE_INTERR 8

/******************************/

int _sceGeReset();
int _sceGeInitCallback3(void *arg0, s32 arg1, void *arg2);
int _sceGeInitCallback4();
int _sceGeSetRegRadr1(int arg0);
int _sceGeSetRegRadr2(int arg0);
int _sceGeSetInternalReg(int type, int arg1, int arg2, int arg3);
int _sceGeInterrupt(int arg0, int arg1, int arg2);
s32 _sceGeSysEventHandler(s32 ev_id, char *ev_name, void *param, s32 *result);
int _sceGeModuleStart();
int _sceGeModuleRebootPhase(s32 arg0 __attribute__((unused)), void *arg1 __attribute__((unused)), s32 arg2 __attribute__((unused)), s32 arg3 __attribute__((unused)));
int _sceGeModuleRebootBefore(void *arg0 __attribute__((unused)), s32 arg1 __attribute__((unused)), s32 arg2 __attribute__((unused)), s32 arg3 __attribute__((unused)));
int _sceGeSetBaseRadr(int arg0, int arg1, int arg2);
int _sceGeEdramResume();
int _sceGeEdramSuspend();
int _sceGeQueueInit();
int _sceGeQueueSuspend();
int _sceGeQueueResume();
void _sceGeFinishInterrupt(int arg0, int arg1, int arg2);
void _sceGeListInterrupt(int arg0, int arg1, int arg2);
int sceGeDebugBreak();
int sceGeDebugContinue(int arg0);
int _sceGeQueueInitCallback();
int _sceGeQueueEnd();
int _sceGeQueueStatus(void);
void _sceGeErrorInterrupt(int arg0, int arg1, int arg2);
void _sceGeListError(u32 cmd, int err);
void _sceGeWriteBp(int *list);
void _sceGeClearBp();
void _sceGeListLazyFlush();
int _sceGeListEnQueue(void *list, void *stall, int cbid, SceGeListArgs * arg,
                      int head);

/****** Structures *********/

typedef struct {
    SceGeDisplayList *curRunning;
    int isBreak;
    SceGeDisplayList *active_first;  //  8
    SceGeDisplayList *active_last;   // 12
    SceGeDisplayList *free_first;    // 16
    SceGeDisplayList *free_last;     // 20
    SceUID drawingEvFlagId;     // 24
    SceUID listEvFlagIds[2];    // 28, 32
    SceGeStack stack[32];       // 36
    int sdkVer;                 // 1060
    int patched;                // 1064
    int syscallId;
    SceGeLazy *lazySyncData;
} SceGeQueue;

typedef struct {
    int unk0;
    int status;
    int listAddr; // 8
    int *stallAddr; // 12
    int intrType; // 16
    int sigCmd;
    int finCmd;
    int endCmd;
} SceGeQueueSuspendInfo;

typedef struct {
    int unk0, unk4, unk8, unk12;
} SceGeBpCmd;

typedef struct {
    int busy;
    int clear;
    int size;
    int size2;
    SceGeBpCmd cmds[10];
} SceGeBpCtrl;

typedef struct {
    char *name;
    u32 *ptr;
} SadrUpdate;

typedef struct {
    char reg1;
    char cmd;
    char reg2;
    char size;
} SceGeMatrix;

/********* Global values *********/

// 6640
SceIntrCb g_GeSubIntrFunc = {
    0, 0, NULL, NULL,
    NULL, NULL, NULL, NULL,
    NULL, NULL, NULL
};

// 666C
SceIntrHandler g_GeIntrOpt = { 12, 0x00000020, &g_GeSubIntrFunc };

// 6678
SceKernelDeci2Ops g_Deci2Ops = { 0x3C,
    {
     (void *)sceGeGetReg,
     (void *)sceGeGetCmd,
     (void *)sceGeGetMtx,
     (void *)sceGeSetReg,
     (void *)sceGeSetCmd,
     (void *)sceGeSetMtx,
     (void *)sceGeGetListIdList,
     (void *)sceGeGetList,
     (void *)sceGeGetStack,
     (void *)sceGePutBreakpoint,
