/**
 * \author artart78
 * \version 6.39 (but only the NIDs changed in 6.60)
 *
 * The audio.prx module RE'ing.
 */

#include "../global.h"

asm(".set noat"); // needed for AUDIO_SET_BUSY()

/** \defgroup Audio Audio Module */

/*@{*/

/* Sets the audio controller busy state.
 * busy: 0 or 1
 */
#define AUDIO_SET_BUSY(busy) asm("lui $at, 0xBE00; sw %0, 0($at)" : : "r" (busy))

/* The audio channel structure. */
typedef struct
{
    /* The channel buffer. */
    void *buf;
    /* The currently unplayed samples count. */
    int curSampleCnt;
    /* The original sample count. */
    u16 sampleCount; // 8
    /* \todo */
    char unk10;
    /* The number of bytes per sample (2 in mono, 4 in stereo). */
    char bytesPerSample; // 11
    /* The left volume. */
    short leftVol;
    /* The right volume. */
    short rightVol;
} SceAudioChannel;

/* The audio controller structure. */
typedef struct
{
    /* TODO */
    u8 buf0[240]; // 0
    /* TODO */
    u8 buf240[272]; // 240
    /* TODO */
    u8 buf512[240]; // 512
    /* TODO */
    u8 buf752[272]; // 752
    /* TODO */
    u32 hwBuf[48]; // 1024
    /* TODO */
    u32 *dmaPtr[3]; // 1216
    /* The audio event flag ID. */
    SceUID evFlagId; // 1228
    /* The audio channels structures. */
    SceAudioChannel chans[8]; // 1232
    /* The channel sample rate. */
    u16 freq; // 1360
    /* The sample rate, converted to be sent to the hardware. */
    u16 hwFreq; // 1362
    /* The audio flags. */
    u8 flags; // 1364
    /* The volume offset. */
    u8 volumeOffset; // 1365
    u8 delayShift; // 1366
    u8 padding1; // 1367
    u16 srcChFreq; // 1368
    u16 srcChSampleCnt; // 1370
    u16 srcVol; // 1372
    u8 numChans; // 1374
    u8 padding2; // 1375
    u32 inputOrigSampleCnt; // 1376
    u32 inputCurSampleCnt; // 1380
    u16 *inputBuf; // 1384
    u8 unkInput0, inputGain, unkInput2, unkInput3, unkInput4, unkInput5; // 1388
    u8 inputHwFreq; // 1394
    u8 inputIsWaiting; // 1395
    u8 inputInited; // 1396
    u8 unkCodecArg; // 1397
    u8 unkCodecRet; // 1398
    u8 unkCodecArgSet; // 1399
    // end: 1400
} SceAudio;

typedef struct
{
    int unk0;
    int gain;
    int unk2;
    int unk3;
    int unk4;
    int unk5;
} SceAudioInputParams;

int audioOutputDmaCb(int unused, int arg1);
int audioOutput(SceAudioChannel *channel, short leftVol, short rightVol, void *buf);
int audioIntrHandler();
int audioEventHandler(int ev_id, char* ev_name, void* param, int* result);
int audioSRCOutputDmaCb(int arg0, int arg1);
int audioInputThread();
int audioInputDmaCb(int arg0, int arg1);

SceAudio g_audio;
char g_audioEventName[] = "SceAudio";
SceSysEventHandler g_audioEvent = {0x40, g_audioEventName, 0x00FFFF00, audioEventHandler, 0, 0, NULL, {0, 0, 0, 0, 0, 0, 0, 0, 0}};

// 0000
/*
 * Update / synchronize the audio buffers to play them.
 * 
 * arg: Set to 1 if called from SRCOutput
 */
void updateAudioBuf(int arg)
{
    int v = arg + 1;
    if (g_audio.flags == 0)
    {
        // 01D0
        AUDIO_SET_BUSY(1);
        sceCodec_driver_B2EF6B19(1);
