/**
 * Author: _Felix_
 * Version: 6.39
 *
 * The ctrl.prx module RE'ing.
 */

#include "../ctrl/ctrl.h"

#define PSP_BUTTON_AMOUNT                       16  
#define PSP_INIT_KEYCONFIG_UPDATER              0x110 //might be incorrect

//0x00002890  -- address and structure is likely to change in other firmware revisions
typedef struct _SceCtrl {
    SceSysTimerId timerID; //0
    int eventFlag; //4
    int btn_cycle; //8
    u8 samplingMode[2]; //12 -- two cell array, samplingMode[0] for usermode, samplingMode[1] for kernel mode
    char unk_Byte_0; //14
    char unk_Byte_1; //15
    int unk_0; //16
    u8 unk_Byte_2; //20
    u8 pollMode; //21
    int unk_1; //24
    sceSysconPacket sysPacket; //28
    char unk_Byte_3; //40
    /*...*/
    SceCtrlLatchInternal latch_user; //220
    int latchData_user; //236
    /*...*/
    char unk_Byte_4; //247
    SceCtrlData *(ctrlDataBuf)[64]; //248
    /*...*/
    SceCtrlLatchInternal latch_kernel; //260
    int latchData_kernel; //276
    void *unkAllocData; //288
    /*...*/
    SceCtrlRapidFire rapidFire[16]; //300 - 556 -- 16 cell array
    /*...*/
    int unk_2; //568
    char unk_Byte_5; //580;
    char unk_Byte_6; //581
    /*...*/
    SceCtrlUnk unk_struct; //584 - 4 cell array
    int unk_3; //664
    int mask; //668
    unsigned type; //672
    int unk_4; //676
    int unk_5; //680
    int unk_6; //684
    int unk_7; //688
    int unk_8; //692
    int idleReset; //696
    int idleBack; //700
    SceCtrlButtonCallback buttonCallback[4]; //704   
    int unk_array2[2]; //768 -- 2 size element array
    int unk_array3[2]; //776 -- 2 size element array
} SceCtrl; //sizeof ButtonCtrl: 788 (0x314)

typedef struct _SceCtrlRapidFire {
    /** The button number representing the button for the rapid fire */
    int button; //0
    int unk_1; //4
    int unk_2; //8
    char resv[2]; //12
    u8 unk_3; //14;
    u8 unk_4; //15;
} SceCtrlRapidFire; //sizeof SceCtrlRapidFire: 16

typedef struct _SceCtrlUnk {
    char unk_1; //0
    char unk_2; //1
    char resv[2]; //2
    int unk_3; //4
    int unk_4; //8
    int unk_5; //12
    int unk_6; //16
} SceCtrlUnk; //sizeof SceCtrlUnk: 20

_PspSysEventHandler eventHandler; //0x00002850

typedef UnknownType;

PSP_MODULE_INFO("sceController_Service", 0x1007, 1, 1);

SceCtrl ctrl;

void vblank_handler(int sub, void* arg); //0x00000440
SceUInt SceKernelAlarmHandler(void *); //0x00001DD8
void CmdFunc(); //0x00000610;

/* sub_00000528 */
static int tick_handler() {
    char unk_1 = 7;
    int suspendFlag;
    int retVal;
    
    suspendFlag = sceKernelCpuSuspendIntr(); //0x0000053C
    if (ctrl.btn_cycle != 0) { //0x00000548 && 0x0000054C
        if ((ctrl.unk_0 == 0) && (ctrl.pollMode != 0)) {//0x00000558 && 0x00000564            
            ctrl.unk_0 = 1; //0x000005C8
            if (ctrl.samplingMode[0] != 0) { //0x000005CC
                unk_1 = 8; //0x000005D4
            }
            ctrl.unk_Byte_3 = unk_1; //0x000005D8
            retVal = sceSysconCmdExecAsync(&ctrl.sysPacket, 1, CmdFunc, 0); //0x000005F8
            if (retVal < 0) { 7/0x00000600
