/* Copyright (C) 2011, 2012 The uOFW team
   See the file COPYING for copying permission.
*/

typedef struct {
	u8	user_ecc[3]; //0
	u8	reserved; //3
	u8	block_fmt; //4
	u8	block_stat; //5
	union {
		u16 lbn;
		struct {
			u8 idx;
			u8 ver;
		} IdStorId;
	}
	union {
		u32 	id;	/* 0x38 0x4a 0xc6 0x6d for IPL area */
		struct {
			u8 formatted;
			u8 readonly;
		} IdStorInfo;
	}
	u8	spare_ecc[2];
	u8	reserved[2];
} SceNandSpare_t;

typedef enum {
	USER_ECC_IN_SPARE	= 0x01,
	NO_AUTO_USER_ECC	= 0x10,
	NO_AUTO_SPARE_ECC	= 0x20
} SceNandEccMode_t;

typedef enum {
	STATE_INVALID			= -1,
	STATE_IDLE				= 0,
	STATE_WAIT_READ_IDLE	= 1,
	STATE_WAIT_WRITE_IDLE	= 2,
	STATE_WAIT_READ_READY	= 3,
	STATE_WAIT_WRITE_READY	= 4
} SceNandState_t;

typedef struct {
	int		mutex_id; //0
	int		event_id; //4
	int     clock_enabled; //8
	int		(*event_cb)(void); //C
	SceNandState_t state; //10
	int		status; //14
	int		len; //18
	int		ppn; //1C
	void   *user; //20
	void   *spare; //24
	SceNandEccMode_t mode; //28
	int		write_enabled; //2C
	int     write_enabled_timestamp; //30
	int		unk1; //34
	u32		resume; //38
	int		unk2; //3C
} SceNandInfo_t;

static SceNandInfo_t sceNandInfo; /* 0x0000D9C4 */

typedef struct {
	u32	ctrl; //0
	u32	stat; //4
	u32	cmd; //8
	u32	addr; //C
	u32	unk1; //10
	u32	rst; //14
	u32	unk2; //18
	u32	unk3; //1C
	u32	dma_addr; //20
	u32	dma_ctrl; //24
	u32	dma_stat; //28
	u32	unk4; //2C
	u32	unk5; //30
	u32	unk6; //34
	u32	dma_intr; //38
	u32	unk7; //3C
	u32	reserved1[112]; //1FC
	u32	resume; //200
	u32	reserved2[63]; //204
	u32	data; //300
} SceNandHwReg_t;

static SceNandHwReg_t *sceNandHwReg = (SceNandHwReg_t *) 0xBD101000;

static u32 g_scramble = 0; /* 0x0000DA00 */

/* 0x0000C784 */
static struct PspSysEventHandler nand_ev_handler = {
	.size = 0x40,
	.name = "SceNand",
	.type_mask = 0x00FFFF00,
	.handler = sceNandEventHandler,
};

typedef struct {
	u32 page_size; //0
	u32 pages_per_block; //4
	s32 total_blocks; //8
	u8 manufacture; //C
	u8 device; //D
	u8 maker_blocks; //E
} __attribute__((packed)) SceNandProperties_t;

static SceNandProperties_t sceNandProperties; /* 0x0000E02C */

typedef struct {
	u8 id[2]; //0
	u8 unk1; //2
	u8 maker_blocks; //3
	u16 page_size; //4
	u16 pages_per_block; //6
	s32 total_blocks; //8
} SceNandChipProperties_t;

static const SceNandChipProperties_t sceNandChips[] = {
	{ { 0x98, 0xE6}, 0x03, 0x01, 0x0200, 0x0010; 0x00000400 },
	{ { 0x98, 0x73}, 0x03, 0x01, 0x0200, 0x0020; 0x00000400 },
	{ { 0x98, 0x75}, 0x03, 0x01, 0x0200, 0x0020; 0x00000800 },
