/* Copyright (C) The uOFW team
   See the file COPYING for copying permission.
*/

#include <common_imp.h>
#include <interruptman.h>
#include <power_kernel.h>
#include <syscon.h>
#include <sysmem_sysclib.h>
#include <sysmem_sysevent.h>
#include <threadman_kernel.h>

#include "power_int.h"

/* Permit Charge delay in microseconds */
#define POWER_DELAY_PERMIT_CHARGING                 (5 * 1000 * 1000)

/* The (initial) priority of the battery worker thread. */
#define POWER_BATTERY_WORKER_THREAD_PRIO            64

/*
 * This value is sepcified for the [batteryAvailabilityStatus] member of ScePowerBattery.
 * It represents the current availability status of the battery in the power service.
 */
typedef enum {
    /* No battery is equipped or the power service cannot communicate with the equipped battery. */
    BATTERY_AVAILABILITY_STATUS_BATTERY_NOT_INSTALLED = 0,
    /* The power service is busy getting new battery information after a battery/power state change. */
    BATTERY_AVAILABILITY_STATUS_BATTERY_IS_BEING_DETECTED,
    /* A battery is correctly equipped and its properties (reamining battery life, charging state,...) can be obtained by API. */
    BATTERY_AVAILABILITY_STATUS_BATTERY_AVAILABLE,
} ScePowerBatteryAvailabilityStatus;

typedef enum {
    POWER_BATTERY_THREAD_OP_START = 0,
    POWER_BATTERY_THREAD_OP_SET_POWER_SUPPLY_STATUS = 1,
    POWER_BATTERY_THREAD_OP_SET_CHARGE_LED_STATUS = 3,
    POWER_BATTERY_THREAD_OP_SET_USB_STATUS = 4,
    POWER_BATTERY_THREAD_OP_SET_REMAIN_CAP = 5,
    POWER_BATTERY_THREAD_OP_SET_FULL_CAP = 6,
    POWER_BATTERY_THREAD_OP_SET_CHARGE_CYCLE = 7,
    POWER_BATTERY_THREAD_OP_SET_LIMIT_TIME = 8,
    POWER_BATTERY_THREAD_OP_SET_BATT_TEMP = 9,
    POWER_BATTERY_THREAD_OP_SET_BATT_ELEC = 10,
    POWER_BATTERY_THREAD_OP_SET_BATT_VOLT = 11,
} PowerBatteryThreadOperation;

typedef struct 
{
    u32 unk0;
    u8 unk4;
    u8 unk5;
    u8 unk6;
    u8 unk7;
} ScePowerSysconSetParamDataTTC; // size: 8

/**
 * This structure represents the power service's internal control block for battery management.
 */
typedef struct 
{
    u32 eventId; // 0
    u32 workerThreadId; // 4
    u32 forceSuspendCapacity; // 8
    u32 lowBatteryCapacity; // 12
    u32 isIdle; // 16
    u32 unk20;
    u32 isUsbChargingSupported; // 24
    u32 isUsbChargingEnabled; // 28
    u32 unk32;
    u32 permitChargingDelayAlarmId; // 36
    u32 unk40; // 40 TODO: Could have something to do with the status of the charge Led (On/Off)
    u32 batteryType; // 44
    u32 unk48;
    PowerBatteryThreadOperation workerThreadNextOp; // 52
    u32 isAcSupplied; // 56
    u32 powerSupplyStatus; // 60 -- TODO: Define macros for possible values
    ScePowerBatteryAvailabilityStatus batteryAvailabilityStatus; // 64
    u32 unk68;
    s32 batteryRemainingCapacity; // 72
    s32 batteryLifePercentage; // 76
    s32 batteryFullCapacity; // 80
    /*
     * Represents the minimum full capacity of a battery. The full capacity of a battery can only be
     * accurately determined with a full charge (where the charge is cutoff at the end of the chargin process).
     * As such, the actual full capacity of a battery might not always be corectly available. In some cases
     * (such as swapping a battery?) the last reported full capacity might be less than the actual full capacity.
     * The [minimumFullCapacity] is thus used to provide a more accurate full capacity value until the battery
     * equipped has been fully charged again and a new full capacity could be ascertained.
     * 
     * The minimum full capacity is determiend by initializing it to the current remaining battery capacity on PSP
     * startup and and then update it to the new reaming capacity value whenever that value is a new maximum
     * during the the use of the PSP system between two cold reboots. For example, this is the case when the battery
     * is being charged when the PSP system is turned on.
     */
    s32 minimumFullCapacity; // 84
    s32 batteryChargeCycle; // 88
    s32 limitTime; // 92
    s32 batteryTemp; // 96
    s32 batteryElec; // 100
    s32 batteryVoltage; // 104
    u32 unk108;
    SceSysconPacket powerBatterySysconPacket; // 112
    ScePowerSysconSetParamDataTTC unk208;
} ScePowerBattery; //size: 216

static inline s32 _scePowerBatteryThreadErrorObtainBattInfo();
static s32 _scePowerBatteryCalcRivisedRcap(void); // 0x00005130
static s32 _scePowerBatteryConvertVoltToRCap(s32 voltage); // 0x00005130
static s32 _scePowerBatterySetTTC(s32 arg0); // 0x000056A4
static s32 _scePowerBatteryInit(u32 isUsbChargingSupported, u32 batteryType); // 0x00005B1C
static s32 _scePowerBatteryDelayedPermitCharging(void* common); // 0x00005EA4
static s32 _scePowerBatterySysconCmdIntr(SceSysconPacket* pSysconPacket, void* param); // 0x00005ED8

ScePowerBattery g_Battery; //0x0000C5B8

// Subroutine sub_00005B1C - Address 0x00005B1C
s32 _scePowerBatteryInit(u32 isUsbChargingSupported, u32 batteryType)
{
    memset(&g_Battery, 0, sizeof(ScePowerBattery)); // 0x00005B50

    g_Battery.permitChargingDelayAlarmId = -1; // 0x00005B74
