/* Copyright (C) The uOFW team
   See the file COPYING for copying permission.
*/

#include <common_imp.h>
#include <display.h>
#include <ge.h>
#include <interruptman.h>
#include <lowio_ddr.h>
#include <lowio_sysreg.h>
#include <power_kernel.h>
#include <syscon.h>
#include <sysmem_kdebug.h>
#include <sysmem_kernel.h>
#include <sysmem_suspend_kernel.h>
#include <sysmem_sysclib.h>
#include <sysmem_sysevent.h>
#include <threadman_kernel.h>

#include "power_int.h"

/* clock frequency limits */

#define PSP_1000_CLOCK_PLL_FREQUENCY_MAX_WLAN_ACTIVE    222

/* Defines Power service specific lower and upper limits for clock speeds. */

#define POWER_PLL_CLOCK_LIMIT_LOWER         1
#define POWER_PLL_CLOCK_LIMIT_UPPER         333

#define POWER_CPU_CLOCK_LIMIT_LOWER         1
#define POWER_CPU_CLOCK_LIMIT_UPPER         333

#define POWER_BUS_CLOCK_LIMIT_LOWER         24
#define POWER_BUS_CLOCK_LIMIT_UPPER         166

/* Defines the fixed set of PLL clock frequencies supported by the power service. */
#define POWER_PLL_OUT_SELECT_SUPPORTED      (SCE_SYSREG_PLL_OUT_SELECT_37MHz | SCE_SYSREG_PLL_OUT_SELECT_148MHz | \
                                             SCE_SYSREG_PLL_OUT_SELECT_190MHz | SCE_SYSREG_PLL_OUT_SELECT_222MHz | \
                                             SCE_SYSREG_PLL_OUT_SELECT_266MHz | SCE_SYSREG_PLL_OUT_SELECT_333MHz | \
                                             SCE_SYSREG_PLL_OUT_SELECT_19MHz | SCE_SYSREG_PLL_OUT_SELECT_74MHz | \
                                             SCE_SYSREG_PLL_OUT_SELECT_96MHz | SCE_SYSREG_PLL_OUT_SELECT_111MHz | \
                                             SCE_SYSREG_PLL_OUT_SELECT_133MHz | SCE_SYSREG_PLL_OUT_SELECT_166MHz)

typedef struct
{
    u32 mutexId; //0
    void* pSm1Ops; //4
    u32 pllOutSelect; //8
    s32 pllUseMask; //12
    s32 pllClockFrequencyInt; //16
    s32 cpuClockFrequencyInt; //20
    s32 busClockFrequencyInt; //24
    float pllClockFrequencyFloat; //28
    float cpuClockFrequencyFloat; //32
    float busClockFrequencyFloat; //36
    u32 clkcCpuGearNumerator; //40
    u32 clkcCpuGearDenominator; //44
    u32 clkcBusGearNumerator; //48
    u32 clkcBusGearDenominator; //52
    u32 isTachyonMaxVoltage; // 56
    s16 tachyonMaxVoltage; //60
    s16 tachyonDefaultVoltage; // 62
    u32 isDdrMaxVoltage; // 64
    s16 ddrMaxVoltage; // 68
    s16 ddrDefaultVoltage; // 70
    s32 isDdrMaxStrength; // 72
    s16 ddrMaxStrength; // 76
    s16 ddrDefaultStrength; // 78
    s32 geEdramRefreshMode; //80
    s32 oldGeEdramRefreshMode; //84
    u16 unk88;
    s16 scCpuClockLowerLimit; // 90
    s16 scCpuClockUpperLimit; // 92
    s16 scBusClockLowerLimit; // 94
    s16 scBusClockUpperLimit; // 96
    s16 pllClockLowerLimit; // 98
    s16 pllClockUpperLimit; // 100
    u16 unk102;
} ScePowerFrequency; //size: 104

typedef struct
{
    u32 frequency; // 0
    u32 pllUseMaskBit; // 4
} ScePowerPllConfiguration; //size: 8

#define POWER_PLL_CONFIGURATIONS            (sizeof g_pllSettings / sizeof g_pllSettings[0])
const ScePowerPllConfiguration g_pllSettings[] =
{
    {.frequency = 19, .pllUseMaskBit = SCE_SYSREG_PLL_OUT_SELECT_19MHz }, /* 0.057 (~ 1/18) */
    {.frequency = 37, .pllUseMaskBit = SCE_SYSREG_PLL_OUT_SELECT_37MHz }, /* 0.111 (1/9) */
    {.frequency = 74, .pllUseMaskBit = SCE_SYSREG_PLL_OUT_SELECT_74MHz }, /* 0.222 (2/9)*/
    {.frequency = 96, .pllUseMaskBit = SCE_SYSREG_PLL_OUT_SELECT_96MHz }, /* 0.286 (~5/18) */
    {.frequency = 111, .pllUseMaskBit = SCE_SYSREG_PLL_OUT_SELECT_111MHz }, /* 0.333 (3/9) */
    {.frequency = 133, .pllUseMaskBit = SCE_SYSREG_PLL_OUT_SELECT_133MHz }, /* 0.4 (7/18) */
    {.frequency = 148, .pllUseMaskBit = SCE_SYSREG_PLL_OUT_SELECT_148MHz }, /* 0.444 (4/9)  */
