/* Copyright (C) The uOFW team
   See the file COPYING for copying permission.
*/

#include <common_imp.h>
#include <interruptman.h>
#include <power_kernel.h>
#include <syscon.h>
#include <sysmem_kernel.h>
#include <sysmem_suspend_kernel.h>
#include <sysmem_sysclib.h>
#include <threadman_kernel.h>

#include "power_int.h"

#define POWER_SWITCH_EVENT_POWER_SWITCH_ACTIVE              0x00000001 /* Indicates that the POWER switch is currently active (i.e. pressed by the user). */
#define POWER_SWITCH_EVENT_POWER_SWITCH_INACTIVE            0x00000002 /* Indicates that the POWER switch is currently inactive (i.e. not pressed by the user). */
#define POWER_SWITCH_EVENT_REQUEST_STANDBY                  0x00000010 /* Indicates a standby operation has been requested. */
#define POWER_SWITCH_EVENT_REQUEST_SUSPEND                  0x00000020 /* Indicates a suspend operation has been requested. */
#define POWER_SWITCH_EVENT_REQUEST_SUSPEND_TOUCH_AND_GO     0x00000040 /* Indicates a suspend-touch-and-go operation has been requested. */
#define POWER_SWITCH_EVENT_REQUEST_COLD_RESET               0x00000080 /* Indicates a cold-reset operation has been requested. */
#define POWER_SWITCH_EVENT_100                              0x00000100 /* TODO */
#define POWER_SWITCH_EVENT_POWER_SWITCH_UNLOCKED            0x00010000 /* Indicates that there are currently no power switch locks in place. */
#define POWER_SWITCH_EVENT_OPERATION_RUNNING                0x00020000 /* Indicates that the power manage is currently running a power switch operation. */
#define POWER_SWITCH_EVENT_IDLE                             0x00040000 /* Indicates that the power switch manager is not currently running a power switch oepration. */
#define POWER_SWITCH_EVENT_PROCESSING_TERMINATION           0x80000000 /* Indicates that the power switch manager is shutting down. */

/*
 * Specifies the duration the user has to hold the POWER switch
 * to generate a standby request. Currently two seconds and represented
 * in microseconds.
 */
#define POWER_SWITCH_STANDBY_REQUEST_HOLD_PERIOD            (2 * 1000 * 1000)

#define SCE_KERNEL_POWER_VOLATILE_MEM_DEFAULT       (0) // TODO: Remove

/** Defines programmatically generated power switch requests. */
typedef enum
{
    SOFTWARE_POWER_SWITCH_REQUEST_NONE = 0,
    SOFTWARE_POWER_SWITCH_REQUEST_STANDBY,
    SOFTWARE_POWER_SWITCH_REQUEST_SUSPEND,
    SOFTWARE_POWER_SWITCH_REQUEST_SUSPEND_TOUCH_AND_GO,
    SOFTWARE_POWER_SWITCH_REQUEST_COLD_RESET
} ScePowerSoftwarePowerSwitchRequest;

typedef struct 
{
    s32 eventId; //0
    s32 semaId; //4
    s32 threadId; //8
    u32 mode; //12
    u32 unk16; //16
    s32 numPowerLocksUser; // 20
    s32 numPowerLocksKernel; // 24
    u32 startAddr; //28
    u32 memSize; //32
    u32 unk36; //36
    ScePowerHardwarePowerSwitchRequest curHardwarePowerSwitchRequest; //40
    ScePowerSoftwarePowerSwitchRequest curSoftwarePowerSwitchRequest; //44
    u32 unk48; //48 TODO: Perhaps a flag indicating whether locking/unlocking is allowed or - more gnerally - standby/suspension/reboot?
    u32 coldResetMode; // 52
    u32 unk56; // 56
    u32 wakeUpCondition; //60
    u32 resumeCount; //64
} ScePowerSwitch; //size: 68

const ScePowerHandlers g_PowerHandler = 
{
    .size = sizeof(ScePowerHandlers),
    .tick = scePowerTick, //0x00002F94
    .lock = scePowerLockForKernel, //0x00001608
    .unlock = scePowerUnlockForKernel, //0x00002C68
    .lockForUser = scePowerLockForUser, //0x00002BF4
    .unlockForUser = scePowerUnlockForUser, //0x00002C24
    .rebootStart = scePowerRebootStart, //0x00002B78
    .memLock = scePowerVolatileMemLock, //0x000012E0
    .memTryLock = scePowerVolatileMemTryLock, //0x00001400
    .memUnlock = scePowerVolatileMemUnlock, //0x00001540
}; //0x00006F48

static s32 _scePowerLock(s32 lockType, s32 isUserLock);
static s32 _scePowerUnlock(s32 lockType, s32 isUserLock);
static s32 _scePowerOffThread(SceSize args, void* argp);
static s32 _scePowerSuspendOperation(u32 arg1);
static s32 _scePowerResumePoint(u32 arg0);
static u32 _scePowerOffCommon(void);
static void _scePowerPowerSwCallback(s32 enable, void* argp);
