/* Copyright (C) The uOFW team
   See the file COPYING for copying permission.
*/

#include <common_imp.h>
#include <power_error.h>
#include <syscon.h>
#include <sysmem_kernel.h>
#include <sysmem_suspend_kernel.h>
#include <sysmem_sysevent.h>

SCE_MODULE_INFO(
    "scePower_Service", 
    SCE_MODULE_KERNEL | 
    SCE_MODULE_ATTR_CANT_STOP | SCE_MODULE_ATTR_EXCLUSIVE_LOAD | SCE_MODULE_ATTR_EXCLUSIVE_START, 
    1, 13);
SCE_MODULE_BOOTSTART("_scePowerModuleStart");
SCE_MODULE_REBOOT_BEFORE("_scePowerModuleRebootBefore");
SCE_MODULE_REBOOT_PHASE("_scePowerModuleRebootPhase");
SCE_SDK_VERSION(SDK_VERSION);

#define BARYON_DATA_REALLY_LOW_BATTERY_CAP_SLOT         (26)
#define BARYON_DATA_LOW_BATTERY_CAP_SLOT                (28)

#define SCE_POWER_POWER_CALLBACK_TOTAL_SLOTS            (32)
#define SCE_POWER_POWER_CALLBACK_MAX_SLOT               (SCE_POWER_POWER_CALLBACK_TOTAL_SLOTS - 1)
#define SCE_POWER_POWER_CALLBACK_USER_SLOTS             (16)
#define SCE_POWER_POWER_CALLBACK_MAX_USER_SLOT          (SCE_POWER_POWER_CALLBACK_USER_SLOTS - 1)

#define BATTERY_LOW_CAPACITY_VALUE                      (216)
#define BATTERY_REALLY_LOW_CAPACITY_VALUE               (72)

#define SCE_POWER_MAX_BACKLIGHT_LEVEL_POWER_INTERNAL    (3)
#define SCE_POWER_MAX_BACKLIGHT_LEVEL_POWER_EXTERNAL    (4)

#define SCE_POWER_CALLBACKARG_LOW_BATTERY           (0x00000100)
#define SCE_POWER_CALLBACKARG_POWER_ONLINE          (0x00001000)
#define SCE_POWER_CALLBACKARG_SUSPENDING            (0x00010000)
#define SCE_POWER_CALLBACKARG_RESUMING              (0x00020000)
#define SCE_POWER_CALLBACKARG_RESUME_COMP           (0x00040000)
#define SCE_POWER_CALLBACKARG_HOLD_SWITCH           (0x40000000)
#define SCE_POWER_CALLBACKARG_POWER_SWITCH			(0x80000000)

#define SCE_KERNEL_POWER_LOCK_DEFAULT               (0)

#define SCE_KERNEL_POWER_VOLATILE_MEM_DEFAULT       (0)

/** Cancel all PSP Hardware timers. */
#define SCE_KERNEL_POWER_TICK_DEFAULT               (0)     
/** Cancel auto-suspend-related timer. */
#define SCE_KERNEL_POWER_TICK_SUSPENDONLY           (1)
/** Cancel LCD-related timer */
#define SCE_KERNEL_POWER_TICK_LCDONLY               (6)	

typedef struct {
    u32 unk0;
    u32 unk4;
    u32 unk8;
    u32 unk12;
} SceSysEventParam;

typedef struct {
    s32 callbackId;
    s32 unk4;
    s32 powerStatus;
    s32 mode;
} ScePowerCallback;

typedef struct {
    ScePowerCallback powerCallback[SCE_POWER_POWER_CALLBACK_TOTAL_SLOTS]; // 0 - 511
    s32 baryonVersion; //512
    u32 unk516; //516 -- power status?
    u32 unk520; //520
    u8 isBatteryLow; //524
    u8 wlanActivity; //525
    u8 watchDog; //526
    u8 unk527;
    s8 unk528;
    s8 unk529;
    u8 ledOffTiming;
    s16 cpuInitSpeed; //534 -- CPU clock init speed
    s16 busInitSpeed; //536 -- Bus clock init speed
    s16 pllInitSpeed; //538 -- PLL clock init speed (PLL = phase-locked loop ?)
} ScePower;

typedef struct {
    s32 eventId; //0
    s32 semaId; //4
    s32 threadId; //8
    u32 mode; //12
    u32 unk16; //16
    s32 unk20; //20
    s32 numPowerLock; //24
    u32 startAddr; //28
    u32 memSize; //32
    u32 unk36; //36
    u32 unk40; //40
    u32 (*unk44)(u32, u32, u32, u32); //44
    u32 unk48; //48
    u32 wakeUpCondition; //60
    u32 resumeCount; //64
} ScePowerSwitch; //size: 68

typedef struct {
    u32 unk16;
    u32 unk20;
    u32 unk24;
    u32 unk28;
    u32 unk32;
    u32 unk36;
    u32 unk40;
    u32 unk44;
    u32 unk48;
    u32 unk52;
} ScePowerIdleData; //size: 40

typedef struct {
    u32 unk0;
    u32 unk4;
    u32 unk8;
    u32 unk12;
    ScePowerIdleData data[8];
} ScePowerIdle;

typedef struct {
    u32 mutexId; //0
    u32 sm1Ops; //4
    u32 pllOutSelect; //8
    u32 pllUseMask; //12
    u32 pllClockFrequencyInt; //16
    u32 clkcCpuFrequencyInt; //20
    u32 clkcBusFrequencyInt; //24
    u32 pllClockFrequencyFloat; //28
    u32 clkcCpuFrequencyFloat; //32
    u32 clkcBusFrequencyFloat; //36
    u32 clkcCpuGearNumerator; //40
    u32 clkcCpuGearDenominator; //44
    u32 clkcBusGearNumerator; //48
    u32 clkcBusGearDenominator; //52
    u32 unk56;
    s16 tachyonVoltage; //60
    s16 unk62;
    u32 unk64;
    s16 unk68;
    s16 unk70;
    s32 unk72;
    s16 unk76;
    s16 unk78;
    u32 geEdramRefreshMode; //80
    u32 oldGeEdramRefreshMode; //84
    u16 unk88;
    u16 scCpuClockLowerLimit; //90
    u16 scCpuClockUpperLimit; //92
    u16 scBusClockLowerLimit; //94
    u16 scBusClockUpperLimit; //96
    u16 pllClockLowerLimit; //98
    u16 pllClockUpperLimit; //100
    u16 unk102;
} ScePowerFrequency; //size: 104

typedef enum  {
    BATTERY_NOT_INSTALLED = 0,
    BATTERY_IS_BEING_DETECTED = 1,
    BATTERY_AVAILABLE = 2,
} ScePowerBatteryAvailabilityStatus;

typedef struct {
    u32 eventId; // 0
    u32 threadId; // 4
    u32 forceSuspendCapacity; // 8
    u32 lowBatteryCapacity; // 12
    u32 unk16;
    u32 unk20;
    u32 unk24;
    u32 unk28;
    u32 unk32;
    u32 alarmId; // 36
    u32 unk40;
    u32 batteryType; // 44
    u32 unk48;
    u32 unk52;
    u32 unk56;
    u32 unk60;
    ScePowerBatteryAvailabilityStatus batteryAvailabilityStatus; // 64
    u32 unk68;
    u32 unk72;
    u32 batteryLifePercentage; // 76
    u32 batteryFullCapacity; // 80
    u32 unk84;
    u32 unk88;
    u32 unk92;
    u32 unk96;
    u32 unk100;
    u32 unk100;
    s32 batteryVoltage; // 104
    u32 unk108;
    u32 unk112;
    u32 unk116;
    u32 unk120;
    u32 unk124;
    u32 unk128;
    u32 unk132;
    u32 unk136;
    u32 unk140;
    u32 unk144;
    u32 unk148;
    u32 unk152;
    u32 unk156;
    u32 unk160;
    u32 unkl64;
    u32 unk168;
    u32 unk172;
    u32 unk176;
    u32 unk180;
    u32 unk184;
    u32 unk188;
    u32 unk192;
    u32 unk196;
    u32 unk200;
    u32 unk204;
    u32 unk208;
} ScePowerBattery; //size: 212

typedef struct {
    u32 frequency;
    u32 unk4;
} ScePowerPllConfiguration; //size: 96

enum ScePowerWlanActivity {
    SCE_POWER_WLAN_DEACTIVATED = 0,
    SCE_POWER_WLAN_ACTIVATED = 1,
};

static SceSysconFunc _scePowerAcSupplyCallback; //sub_0x00000650
static SceSysconFunc _scePowerLowBatteryCallback; //sub_0x000006C4
static s32 _scePowerSysEventHandler(s32 eventId, char *eventName, void *param, s32 *result); //sub_0x0000071C
