/* Copyright (C) The uOFW team
   See the file COPYING for copying permission.
*/

#include <common_imp.h>
#include <display.h>
#include <ge.h>
#include <interruptman.h>
#include <lowio_sysreg.h>
#include <power_kernel.h>
#include <syscon.h>
#include <sysmem_kdebug.h>
#include <sysmem_kernel.h>
#include <sysmem_suspend_kernel.h>
#include <sysmem_sysevent.h>
#include <threadman_kernel.h>

SCE_MODULE_INFO(
    "scePower_Service", 
    SCE_MODULE_KERNEL | 
    SCE_MODULE_ATTR_CANT_STOP | SCE_MODULE_ATTR_EXCLUSIVE_LOAD | SCE_MODULE_ATTR_EXCLUSIVE_START, 
    1, 13);
SCE_MODULE_BOOTSTART("_scePowerModuleStart");
SCE_MODULE_REBOOT_BEFORE("_scePowerModuleRebootBefore");
SCE_MODULE_REBOOT_PHASE("_scePowerModuleRebootPhase");
SCE_SDK_VERSION(SDK_VERSION);

#define PSP_CLOCK_PLL_FREQUENCY_MIN                     19
#define PSP_CLOCK_PLL_FREQUENCY_MAX                     333
#define PSP_1000_CLOCK_PLL_FREQUENCY_MAX_WLAN_ACTIVE    222

#define PSP_CLOCK_CPU_FREQUENCY_MIN                     1
#define PSP_CLOCK_CPU_FREQUENCY_MAX                     333

#define PSP_CLOCK_BUS_FREQUENCY_MIN                     1
#define PSP_CLOCK_BUS_FREQUENCY_MAX                     167

/* Defines Power service specific lower and upper limits for clock speeds. */

#define POWER_PLL_CLOCK_LIMIT_LOWER         1
#define POWER_PLL_CLOCK_LIMIT_UPPER         333

#define POWER_CPU_CLOCK_LIMIT_LOWER         1
#define POWER_CPU_CLOCK_LIMIT_UPPER         333

#define POWER_BUS_CLOCK_LIMIT_LOWER         24
#define POWER_BUS_CLOCK_LIMIT_UPPER         166

/* Defines the fixed set of PLL clock frequencies supported by the power service. */
#define POWER_PLL_OUT_SELECT_SUPPORTED      (SCE_SYSREG_PLL_OUT_SELECT_37MHz | SCE_SYSREG_PLL_OUT_SELECT_148MHz | \
                                             SCE_SYSREG_PLL_OUT_SELECT_190MHz | SCE_SYSREG_PLL_OUT_SELECT_222MHz | \
                                             SCE_SYSREG_PLL_OUT_SELECT_266MHz | SCE_SYSREG_PLL_OUT_SELECT_333MHz | \
                                             SCE_SYSREG_PLL_OUT_SELECT_19MHz | SCE_SYSREG_PLL_OUT_SELECT_74MHz | \
                                             SCE_SYSREG_PLL_OUT_SELECT_96MHz | SCE_SYSREG_PLL_OUT_SELECT_111MHz | \
                                             SCE_SYSREG_PLL_OUT_SELECT_133MHz | SCE_SYSREG_PLL_OUT_SELECT_166MHz)

#define BARYON_DATA_REALLY_LOW_BATTERY_CAP_SLOT         (26)
#define BARYON_DATA_LOW_BATTERY_CAP_SLOT                (28)

#define POWER_CALLBACK_TOTAL_SLOTS_KERNEL               (32)
#define POWER_CALLBACK_MAX_SLOT_KERNEL                  (POWER_CALLBACK_TOTAL_SLOTS_KERNEL - 1)
#define POWER_CALLBACK_TOTAL_SLOTS_USER                 (16)
#define POWER_CALLBACK_MAX_SLOT_USER                    (POWER_CALLBACK_TOTAL_SLOTS_USER - 1)

#define BATTERY_LOW_CAPACITY_VALUE                      (216)
#define BATTERY_REALLY_LOW_CAPACITY_VALUE               (72)

#define SCE_POWER_MAX_BACKLIGHT_LEVEL_POWER_INTERNAL    (3)
#define SCE_POWER_MAX_BACKLIGHT_LEVEL_POWER_EXTERNAL    (4)

#define SCE_KERNEL_POWER_VOLATILE_MEM_DEFAULT       (0)

/** Cancel all PSP Hardware timers. */
#define SCE_KERNEL_POWER_TICK_DEFAULT               (0)     
/** Cancel auto-suspend-related timer. */
#define SCE_KERNEL_POWER_TICK_SUSPENDONLY           (1)
/** Cancel LCD-related timer */
#define SCE_KERNEL_POWER_TICK_LCDONLY               (6)	

/* Permit Charge delay in microseconds */
#define POWER_DELAY_PERMIT_CHARGING                 (5 * 1000 * 1000)

/* The (initial) priority of the battery worker thread. */
#define POWER_BATTERY_WORKER_THREAD_PRIO            (64)

/* This constant indicates that there are currently no power switch locks in place. */
#define POWER_SWITCH_EVENT_POWER_SWITCH_UNLOCKED        0x00010000
#define POWER_SWITCH_EVENT_00040000                     0x00040000 // TOOD

typedef struct {
    u32 unk0;
    u32 unk4;
    u32 unk8;
    u32 unk12;
} SceSysEventParam;

typedef struct {
    SceUID cbid; // 0
    s32 unk4; // 4
    s32 powerStatus; //8
    s32 mode; // 12 TODO: Perhaps execution mode, synchron = 1, otherwise asynchron? More data needed...
} ScePowerCallback;

typedef struct {
    ScePowerCallback powerCallback[POWER_CALLBACK_TOTAL_SLOTS_KERNEL]; // 0 - 511
    s32 baryonVersion; //512
    u32 unk516; //516 -- power status?
    u32 callbackArgMask; //520
    u8 isBatteryLow; //524
    u8 wlanActivity; //525 -- TODO: Perhaps rename to isWlanActivated?
    u8 watchDog; //526
    u8 isWlanSuppressChargingEnabled; // 527
    s8 unk528;
    s8 wlanExclusiveClockLimit; // 529
    u8 ledOffTiming;
    s16 cpuInitSpeed; //534 -- CPU clock init speed
    s16 busInitSpeed; //536 -- Bus clock init speed
    s16 pllInitSpeed; //538 -- PLL clock init speed (PLL = phase-locked loop ?)
} ScePower;

typedef struct {
    s32 eventId; //0
    s32 semaId; //4
    s32 threadId; //8
    u32 mode; //12
    u32 unk16; //16
    s32 numPowerLocksUser; // 20
    s32 numPowerLocksKernel; // 24
    u32 startAddr; //28
    u32 memSize; //32
    u32 unk36; //36
    u32 unk40; //40
    u32 (*unk44)(u32, u32, u32, u32); //44
    u32 unk48; //48 TODO: Perhaps a flag indicating whether locking/unlocking is allowed or - more gnerally - standby/suspension/reboot?
    u32 wakeUpCondition; //60
    u32 resumeCount; //64
} ScePowerSwitch; //size: 68

typedef struct {
    u32 unk16;
    u32 unk20;
    u32 unk24;
    u32 unk28;
    u32 unk32;
    u32 unk36;
    u32 unk40;
    u32 unk44;
    u32 unk48;
    u32 unk52;
} ScePowerIdleData; //size: 40

typedef struct {
    u32 unk0;
    u32 unk4;
    u32 unk8;
    u32 unk12;
    ScePowerIdleData data[8];
} ScePowerIdle;

typedef struct {
    u32 mutexId; //0
    void *pSm1Ops; //4
    u32 pllOutSelect; //8
    s32 pllUseMask; //12
    s32 pllClockFrequencyInt; //16
    s32 cpuClockFrequencyInt; //20
    s32 busClockFrequencyInt; //24
    float pllClockFrequencyFloat; //28
    float cpuClockFrequencyFloat; //32
    float busClockFrequencyFloat; //36
    u32 clkcCpuGearNumerator; //40
    u32 clkcCpuGearDenominator; //44
    u32 clkcBusGearNumerator; //48
    u32 clkcBusGearDenominator; //52
    u32 isTachyonMaxVoltage; // 56
    s16 tachyonMaxVoltage; //60
    s16 tachyonDefaultVoltage; // 62
    u32 isDdrMaxVoltage; // 64
    s16 ddrMaxVoltage; // 68
    s16 ddrDefaultVoltage; // 70
    s32 isDdrMaxStrength; // 72
    s16 ddrMaxStrength; // 76
    s16 ddrDefaultStrength; // 78
    s32 geEdramRefreshMode; //80
    s32 oldGeEdramRefreshMode; //84
    u16 unk88;
    u16 scCpuClockLowerLimit; //90
    u16 scCpuClockUpperLimit; //92
    u16 scBusClockLowerLimit; //94
    u16 scBusClockUpperLimit; //96
    u16 pllClockLowerLimit; //98
    u16 pllClockUpperLimit; //100
    u16 unk102;
} ScePowerFrequency; //size: 104

typedef enum  {
    BATTERY_NOT_INSTALLED = 0,
    BATTERY_IS_BEING_DETECTED = 1,
    BATTERY_AVAILABLE = 2,
} ScePowerBatteryAvailabilityStatus;

typedef enum {
    POWER_BATTERY_THREAD_OP_START = 0,
    POWER_BATTERY_THREAD_OP_SET_POWER_SUPPLY_STATUS = 1,
    POWER_BATTERY_THREAD_OP_SET_CHARGE_LED_STATUS = 3,
    POWER_BATTERY_THREAD_OP_SET_USB_STATUS = 4,
    POWER_BATTERY_THREAD_OP_SET_REMAIN_CAP = 5,
    POWER_BATTERY_THREAD_OP_SET_FULL_CAP = 6, 
    POWER_BATTERY_THREAD_OP_SET_CHARGE_CYCLE = 7,
    POWER_BATTERY_THREAD_OP_SET_LIMIT_TIME = 8,
    POWER_BATTERY_THREAD_OP_SET_BATT_TEMP = 9,
    POWER_BATTERY_THREAD_OP_SET_BATT_ELEC = 10,
    POWER_BATTERY_THREAD_OP_SET_BATT_VOLT = 11,
} PowerBatteryThreadOperation;

typedef struct {
    u32 unk0;
    u8 unk4;
    u8 unk5;
    u8 unk6;
    u8 unk7;
} ScePowerSysconSetParamDataTTC; // size: 8

typedef struct {
    u32 eventId; // 0
    u32 workerThreadId; // 4
    u32 forceSuspendCapacity; // 8
    u32 lowBatteryCapacity; // 12
    u32 isIdle; // 16
    u32 unk20;
    u32 isUsbChargingSupported; // 24
    u32 isUsbChargingEnabled; // 28
    u32 unk32;
    u32 permitChargingDelayAlarmId; // 36
    u32 unk40; // 40 TODO: Could have something to do with the status of the charge Led (On/Off)
    u32 batteryType; // 44
    u32 unk48;
    PowerBatteryThreadOperation workerThreadNextOp; // 52
    u32 isAcSupplied; // 56
    u32 powerSupplyStatus; // 60 -- TODO: Define constants for possible values
    ScePowerBatteryAvailabilityStatus batteryAvailabilityStatus; // 64
    u32 unk68;
    s32 batteryRemainingCapacity; // 72
    s32 batteryLifePercentage; // 76
    s32 batteryFullCapacity; // 80
    s32 unk84;
    s32 batteryChargeCycle; // 88
    s32 limitTime; // 92
    s32 batteryTemp; // 96
    s32 batteryElec; // 100
    s32 batteryVoltage; // 104
    u32 unk108;
    SceSysconPacket powerBatterySysconPacket; // 112
    ScePowerSysconSetParamDataTTC unk208;
} ScePowerBattery; //size: 216

typedef struct {
    u32 frequency; // 0
    u32 pllUseMaskBit; // 4
} ScePowerPllConfiguration; //size: 8

enum ScePowerWlanActivity {
    SCE_POWER_WLAN_DEACTIVATED = 0,
    SCE_POWER_WLAN_ACTIVATED = 1,
};

static SceSysconFunc _scePowerAcSupplyCallback; //sub_0x00000650
static SceSysconFunc _scePowerLowBatteryCallback; //sub_0x000006C4
static s32 _scePowerSysEventHandler(s32 eventId, char *eventName, void *param, s32 *result); //sub_0x0000071C
static void _scePowerNotifyCallback(s32 deleteCbFlag, s32 applyCbFlag, s32 arg2); // sub_00000BE0
static s32 _scePowerIsCallbackBusy(u32 cbFlag, SceUID* pCbid); // sub_00000CC4
static s32 _scePowerInitCallback(); //sub_0x0000114C

static s32 _scePowerLock(s32 lockType, s32 isUserLock); // 00001624
static s32 _scePowerUnlock(s32 lockType, s32 isUserLock); // 0x00002E1C

