/* Copyright (C) The uOFW team
   See the file COPYING for copying permission.
*/

#include <common_imp.h>
#include <ctrl.h>
#include <display.h>
#include <interruptman.h>
#include <lowio_ddr.h>
#include <lowio_sysreg.h>
#include <modulemgr_init.h>
#include <power_kernel.h>
#include <syscon.h>
#include <sysmem_kdebug.h>
#include <sysmem_kernel.h>
#include <sysmem_suspend_kernel.h>
#include <sysmem_sysclib.h>
#include <sysmem_sysevent.h>
#include <sysmem_utils_kernel.h>
#include <threadman_kernel.h>

#include "power_int.h"

#define POWER_SWITCH_WORKER_THREAD_INIT_PRIO                4

#define POWER_SWITCH_EVENT_POWER_SWITCH_ACTIVE              0x00000001 /* Indicates that the POWER switch is currently active (i.e. pressed by the user). */
#define POWER_SWITCH_EVENT_POWER_SWITCH_INACTIVE            0x00000002 /* Indicates that the POWER switch is currently inactive (i.e. not pressed by the user). */
#define POWER_SWITCH_EVENT_REQUEST_STANDBY                  0x00000010 /* Indicates a standby operation has been requested. */
#define POWER_SWITCH_EVENT_REQUEST_SUSPEND                  0x00000020 /* Indicates a suspend operation has been requested. */
#define POWER_SWITCH_EVENT_REQUEST_SUSPEND_TOUCH_AND_GO     0x00000040 /* Indicates a suspend-touch-and-go operation has been requested. */
#define POWER_SWITCH_EVENT_REQUEST_COLD_RESET               0x00000080 /* Indicates a cold-reset operation has been requested. */
#define POWER_SWITCH_EVENT_100                              0x00000100 /* TODO */
#define POWER_SWITCH_EVENT_POWER_SWITCH_UNLOCKED            0x00010000 /* Indicates that there are currently no power switch locks in place. */
#define POWER_SWITCH_EVENT_OPERATION_RUNNING                0x00020000 /* Indicates that the power manage is currently running a power switch operation. */
#define POWER_SWITCH_EVENT_IDLE                             0x00040000 /* Indicates that the power switch manager is not currently running a power switch oepration. */
#define POWER_SWITCH_EVENT_PROCESSING_TERMINATION           0x80000000 /* Indicates that the power switch manager is shutting down. */

/*
 * Specifies the duration the user has to hold the POWER switch
 * to generate a standby request. Currently two seconds and represented
 * in microseconds.
 */
#define POWER_SWITCH_STANDBY_REQUEST_HOLD_PERIOD            (2 * 1000 * 1000)

/** Defines programmatically generated power switch requests. */
typedef enum
{
    SOFTWARE_POWER_SWITCH_REQUEST_NONE = 0,
    SOFTWARE_POWER_SWITCH_REQUEST_STANDBY,
    SOFTWARE_POWER_SWITCH_REQUEST_SUSPEND,
    SOFTWARE_POWER_SWITCH_REQUEST_SUSPEND_TOUCH_AND_GO,
    SOFTWARE_POWER_SWITCH_REQUEST_COLD_RESET
} ScePowerSoftwarePowerSwitchRequest;

typedef struct 
{
    s32 eventId; //0
    s32 volatileMemorySemaId; //4
    s32 workerThreadId; // 8
    u32 mode; //12
    u32 powerLockForUserShouldForceWait; // 16
    s32 numPowerLocksUser; // 20
    s32 numPowerLocksKernel; // 24
    /* Start address of the PSP's RAM area reserved for volatile memory. */
    u32 volatileMemoryReservedAreaStartAddr; //28
    /* Size of the PSP's RAM area reserved for volatile memory. */
    u32 volatileMemoryReservedAreaSize; // 32
    /* 
     * Indicates whether an application has acquired control over the PSP's RAM area reserved 
     * for volatile memory. 
     */
    u32 isVolatileMemoryReservedAreaInUse; // 36
    ScePowerHardwarePowerSwitchRequest curHardwarePowerSwitchRequest; //40
    ScePowerSoftwarePowerSwitchRequest curSoftwarePowerSwitchRequest; //44
    u32 unk48; //48 TODO: Perhaps a flag indicating whether locking/unlocking is allowed or - more gnerally - standby/suspension/reboot?
    u32 coldResetMode; // 52
    u32 unk56; // 56
    u32 wakeUpCondition; //60
    u32 resumeCount; //64
} ScePowerSwitch; //size: 68

typedef struct
{
    u8 scratchpad[SCE_SCRATCHPAD_SIZE]; // 0 
    u8 hwResetVector[HW_RESET_VECTOR_SIZE]; // 0x4000
    s32 pllOutSelect; // 20480 (0x5000)
    s32 unk20484; // 20484 (0x5004)

    // TODO: Starting here until unk20696 (included) could be a buffer
    // of length 212.

    s32 unk20488; // 20488 (0x5008)
    s32 unk20492; // 20492
    s32 unk20496; // 20496
    s32 unk20504; // 20504
    s32 unk20508; // 20508
    u32 unk20516; // 20516
    // Note: This might not actually be an array but choosing one for convenience here
    // (until more data is available)
    u32 unk20520[44]; // 20520
    u32 unk20696; // 20696
    u32 unk20700; // 20700 (0x50DC)
    // Note: This might not actually be an array but choosing one for convenience here
    // (until more data is available)
    u32 unk20704[8]; // 20704
} ScePowerResume; // Size: 0x5100 - 20736 (TODO: Confirm)

const ScePowerHandlers g_PowerHandler = 
{
    .size = sizeof(ScePowerHandlers),
    .tick = scePowerTick, //0x00002F94
    .lock = scePowerLockForKernel, //0x00001608
