/* Copyright (C) The uOFW team
   See the file COPYING for copying permission.
*/

#include <common_imp.h>
#include <idstorage.h>
#include <interruptman.h>
#include <modulemgr_init.h>
#include <power_kernel.h>
#include <syscon.h>
#include <sysmem_kdebug.h>
#include <sysmem_kernel.h>
#include <sysmem_suspend_kernel.h>
#include <sysmem_sysevent.h>
#include <sysmem_sysclib.h>
#include <threadman_kernel.h>

#include "power_int.h"

SCE_MODULE_INFO(
    "scePower_Service", 
    SCE_MODULE_KERNEL | 
    SCE_MODULE_ATTR_CANT_STOP | SCE_MODULE_ATTR_EXCLUSIVE_LOAD | SCE_MODULE_ATTR_EXCLUSIVE_START, 
    1, 13);
SCE_MODULE_BOOTSTART("_scePowerModuleStart");
SCE_MODULE_REBOOT_BEFORE("_scePowerModuleRebootBefore");
SCE_MODULE_REBOOT_PHASE("_scePowerModuleRebootPhase");
SCE_SDK_VERSION(SDK_VERSION);

#define POWER_CALLBACK_TOTAL_SLOTS_KERNEL               (32)
#define POWER_CALLBACK_MAX_SLOT_KERNEL                  (POWER_CALLBACK_TOTAL_SLOTS_KERNEL - 1)
#define POWER_CALLBACK_TOTAL_SLOTS_USER                 (16)
#define POWER_CALLBACK_MAX_SLOT_USER                    (POWER_CALLBACK_TOTAL_SLOTS_USER - 1)

/*
 * The remaining capacity threshold for the PSP battery at which we treat the battery charge state
 * at being low enough that we force a PSP device suspension. In mAh. Given a standard PSP battery
 * with a capacity of 1800 mAh, this threshold is set to 4% of a full charge.
 */
#define BATTERY_FORCE_SUSPEND_CAPACITY_THRESHOLD            72
/* 
 * The remaining capacity threshold for the PSP battery at which we treat the battery as being
 * in the [low battery] state. In mAh. Given a standard PSP battery with a capacity of 1800 mAh,
 * this threshold is set to 12% of a full charge.
 */
#define BATTERY_LOW_CAPACITY_THRESHOLD                      216

/* Defines the initial PLL clock frequency (in MHz) on startup for (game) applications. */
#define PSP_CLOCK_PLL_FREQUENCY_STARTUP_GAME_APP_UPDATER    222
/* Defines the initial CPU clock frequency (in MHz) on startup for (game) applications. */
#define PSP_CLOCK_CPU_FREQUENCY_STARTUP_GAME_APP_UPDATER    222
/* Defines the initial bus clock frequency (in MHz) on startup for (game) applications. */
#define PSP_CLOCK_BUS_FREQUENCY_STARTUP_GAME_APP_UPDATER    111

// TODO: Remove

/** Cancel all PSP Hardware timers. */
#define SCE_KERNEL_POWER_TICK_DEFAULT               (0)     
/** Cancel auto-suspend-related timer. */
#define SCE_KERNEL_POWER_TICK_SUSPENDONLY           (1)
/** Cancel LCD-related timer */
#define SCE_KERNEL_POWER_TICK_LCDONLY               (6)	

/**
 * This structure represents a control block for a registered power callback.
 */
typedef struct  {
    /* The callback ID. */
    SceUID cbid; // 0
    /* 
     * Contains the callback one-off argument (to be passed to the callback function) accumulated across
     * all current callback notifications not yet processed by the system for this power callback.
     * Example for a one-off callback power state arg: SCE_POWER_CALLBACKARG_RESUME_COMP
     */
    s32 delayedCallbacksAccumulatedOneOffArg; // 4
    /*
     * Contains the complete (power state) argument to be passed to the callback function.
     * The (accumulated) one-off callback argument is included as well as the callback argument describing 
     * the general power state (such as whether the POWER switch is currently active or the remaining battery
     * capacity in [%]).
     */
    s32 powerStateCallbackArg; // 8
    /* The callback mode. */
    s32 mode; // 12
} ScePowerCallback;

/**
 * This structure represents the power service's internal control block.
 */
typedef struct {
    ScePowerCallback powerCallback[POWER_CALLBACK_TOTAL_SLOTS_KERNEL]; // 0 - 511
    s32 baryonVersion; // 512
    u32 curPowerStateForCallbackArg; // 516
    u32 callbackArgMask; // 520
    u8 isBatteryLow; // 524
    u8 wlanActivity; // 525
    u8 watchDog; // 526
    u8 isWlanSuppressChargingEnabled; // 527
    u8 backlightMaximumWlanActive; // 528
    /* 
     * The WLAN exclusive PLL clock frequency limit. If WLAN is active, the PLL clock frequency cannot be set
     * to a value which is higher than this clock limit. If WLAN is inactive, this clock limit dictates if the
     * PLL is currently operating at a clock frequency where WLAN can be activated.
     */
    s8 wlanExclusivePllClockLimit; // 529
    u8 ledOffTiming; // 530
    u8 padding[3];
    /* 
     * The initial CPU clock frequency set by the power service when a game, application or updater process
     * has been launched.
     */
    u16 cpuClockInitialFrequencyGameAppUpdater; // 534
    /*
     * The initial bus clock frequency set by the power service when a game, application or updater process
     * has been launched.
     */
    u16 busClockInitialFrequencyGameAppUpdater; // 536
    /*
     * The initial PLL clock frequency set by the power service when a game, application or updater process
     * has been launched.
     */
    u16 pllClockInitialFrequencyGameAppUpdater; // 538
} ScePower; // size = 540

static void _scePowerAcSupplyCallback(s32 enable, void* argp); //sub_0x00000650
static void _scePowerLowBatteryCallback(s32 enable, void* argp); //sub_0x000006C4
static s32 _scePowerSysEventHandler(s32 eventId, char *eventName, void *param, s32 *result); //sub_0x0000071C
static s32 _scePowerInitCallback(void *data, s32 arg, void *opt); //sub_0x0000114C

SceSysEventHandler g_PowerSysEv = 
{
    .size = sizeof(SceSysEventHandler),
    .name = "ScePower",
    .typeMask = SCE_SUSPEND_EVENTS | SCE_RESUME_EVENTS,
    .handler = _scePowerSysEventHandler,
    .gp = 0,
    .busy = SCE_FALSE,
    .next = NULL,
    .reserved = {
        [0] = 0,
        [1] = 0,
        [2] = 0,
        [3] = 0,
        [4] = 0,
        [5] = 0,
        [6] = 0,
        [7] = 0,
        [8] = 0,
    }  
}; // 0x00007040

ScePower g_Power; // 0x00007080

