/* Copyright (C) 2011, 2012 The uOFW team
   See the file COPYING for copying permission.
*/

#include <common_imp.h>

#include <clockgen.h>
#include <codec.h>
#include <dmacman.h>
#include <interruptman.h>
#include <lowio_ddr.h>
#include <lowio_sysreg.h>
#include <sysmem_kernel.h>
#include <sysmem_sysclib.h>
#include <sysmem_sysevent.h>
#include <sysmem_utils_kernel.h>
#include <threadman_kernel.h>

#include <audio.h>

SCE_MODULE_INFO("sceAudio_Driver", SCE_MODULE_KERNEL | SCE_MODULE_ATTR_CANT_STOP | SCE_MODULE_ATTR_EXCLUSIVE_LOAD
                                   | SCE_MODULE_ATTR_EXCLUSIVE_START, 1, 13);
SCE_MODULE_BOOTSTART("sceAudioInit");
SCE_MODULE_REBOOT_BEFORE("sceAudioEnd");
SCE_MODULE_STOP("sceAudioEnd");
SCE_SDK_VERSION(SDK_VERSION);

/* The audio channel structure. */
typedef struct
{
    /* The channel buffer. */
    void *buf;
    /* The currently unplayed samples count. */
    int curSampleCnt;
    /* The original sample count. */
    u16 sampleCount; // 8
    /* \todo */
    char unk10;
    /* The number of bytes per sample (2 in mono, 4 in stereo). */
    char bytesPerSample; // 11
    /* The left volume. */
    short leftVol;
    /* The right volume. */
    short rightVol;
} SceAudioChannel;

/* The audio controller structure. */
typedef struct
{
    u8 buf0[240]; // 0
    u8 buf240[272]; // 240
    u8 buf512[240]; // 512
    u8 buf752[272]; // 752
    u32 hwBuf[48]; // 1024
    u32 *dmaPtr[3]; // 1216
    /* The audio event flag ID. */
    SceUID evFlagId; // 1228
    /* The audio channels structures. */
    SceAudioChannel chans[8]; // 1232
    /* The channel sample rate. */
    u16 freq; // 1360
    /* The sample rate, converted to be sent to the hardware. */
    u16 hwFreq; // 1362
    /* The audio flags. */
    u8 flags; // 1364
    /* The volume offset. */
    u8 volumeOffset; // 1365
    u8 delayShift; // 1366
    u8 padding1; // 1367
    u16 srcChFreq; // 1368
    u16 srcChSampleCnt; // 1370
    u16 srcVol; // 1372
    u8 numChans; // 1374
    u8 padding2; // 1375
    u32 inputOrigSampleCnt; // 1376
    u32 inputCurSampleCnt; // 1380
    u16 *inputBuf; // 1384
    u8 unkInput0, inputGain, unkInput2, unkInput3, unkInput4, unkInput5; // 1388
    u8 inputHwFreq; // 1394
    u8 inputIsWaiting; // 1395
    u8 inputInited; // 1396
    u8 unkCodecArg; // 1397
    u8 unkCodecRet; // 1398
    u8 unkCodecArgSet; // 1399
    // end: 1400
} SceAudio;

void audioHwInit();
int audioOutputDmaCb(int unused, int arg1);
int audioOutput(SceAudioChannel *channel, int leftVol, int rightVol, void *buf);
int audioIntrHandler();
s32 audioEventHandler(s32 ev_id, char* ev_name __attribute__((unused)), void* param, s32* result);
int audioSRCOutput(int vol, void *buf);
int audioSRCOutputDmaCb(int arg0, int arg1);
int audioInputSetup();
int audioInputInit(int arg0, int gain, int arg2, int arg3, int arg4, int arg5);
int audioInput(int sampleCount, int freq, void *buf);
int audioInputThread();
int audioInputDmaCb(int arg0, int arg1);

SceAudio g_audio;
SceSysEventHandler g_audioEvent = {0x40, "SceAudio", 0x00FFFF00, audioEventHandler, 0, 0, NULL, {0, 0, 0, 0, 0, 0, 0, 0, 0}};

// 0000
/*
 * Update / synchronize the audio buffers to play them.
 * 
 * arg: Set to 1 if called from SRCOutput
 */
void updateAudioBuf(int arg)
{
    dbg_printf("Running %s\n", __FUNCTION__);
    int v = arg + 1;
