/* Copyright (C) 2011, 2012, 2013 The uOFW team
   See the file COPYING for copying permission.
*/

#include <common_imp.h>
#include <loadexec.h>

typedef struct
{
    int opt0;
    int opt1;
    char *fileName;
    SceKernelLoadExecVSHParam *args2;
    int opt4;
    void *opt5;
    int opt6;
    int opt7;
    int opt8;
} RebootArgs; 

typedef struct
{
    void *argp; // 0
    int args; // 4
    int unk8, unk12, unk16, unk20, unk24;
} SceKernelArgsStor;

typedef struct
{
    void *addr; // 0
    int unk4, unk8, unk12;
    void *addr1; // 16
    void *addr2; // 20
    int unk24;
    int curArgs; // 28
    SceKernelArgsStor *args; // 32
    int unk36, unk40;
    int model; // 44
    int unk48, unk52, unk56, unk60;
    int dipswLo; // 64
    int dipswHi; // 68
    int unk72, unk76, unk80;
    // ... ? size is max 0x1000
} SceKernelUnkStruct;

static char g_encryptedBootPath[]   = "disc0:/PSP_GAME/SYSDIR/EBOOT.BIN"; // 0x3AE4
static char g_unencryptedBootPath[] = "disc0:/PSP_GAME/SYSDIR/BOOT.BIN"; // 0x3B18
static char g_gameStr[] = "game"; // 0x3B38
static char g_umdEmuStr[] = "umdemu"; // 0x3B40
static char g_mlnAppStr[] = "mlnapp"; // 0x3B38
static char g_vshStr[] = "vsh"; // 0x3B40

SceUID g_loadExecMutex; // 0xD3C0
SceUID g_loadExecCb; // 0xD3C4
int g_loadExecIsInited; // 0xD3C8
int g_valAreSet; // 0xD3CC
int g_val0, g_val1, g_val2; // 0xD3D0, 0xD3D4, 0xD3D8
void (*g_loadExecFunc)(); // 0xD3DC, some unknown callback

char **g_encryptedBootPathPtr = &g_encryptedBootPath; // 0xD390 [hardcoded??]

int *g_unkCbInfo[4]; // 0xD400

//#define EXEC_START 0x3E80 // TODO: store new executable in an array and set this as the executable start & end
//#define EXEC_END   0xD350

int LoadExecForUser_362A956B()
{
    int oldK1 = pspShiftK1();
    SceUID cbId;
    SceKernelCallbackInfo cbInfo;
    int *argOpt;

    cbId = sceKernelCheckExitCallback();
    cbInfo.size = 56;
    int ret = sceKernelReferCallbackStatus(cbId, &cbInfo);
    if (ret < 0) {
        pspSetK1(oldK1);
        return ret;
    }
    int *argm8 = cbInfo.common - 8;
    if (!pspK1PtrOk(argm8)) {
        pspSetK1(oldK1);
        return 0x800200D3;
    }
    int pos  = *(int*)(argm8 + 0);
    int *unk = (int*)*(int*)(argm8 + 4);
    if ((unsigned int)pos >= 4) {
        pspSetK1(oldK1);
        return 0x800200D2;
    }
    if (!pspK1PtrOk(unk))
        return 0x800200D3;
    pspSetK1(oldK1);
    if (unk[0] < 12)
        return 0x800201BC;
    unk[1] = 0;
    unk[2] = -1;
    g_unkCbInfo[pos] = unk;
    return 0;
}

