/* Copyright (C) 2011, 2012 The uOFW team
   See the file COPYING for copying permission.
*/

/**
 * ctrl.c
 *    Reverse engineered controller libraries of the SCE PSP system.
 * Author: _Felix_
 * Version: 6.60
 *
 */

#include <display.h>
#include <modulemgr_init.h>
#include <interruptman.h>
#include <syscon.h>
#include <sysmem_kdebug.h>
#include <sysmem_kernel.h>
#include <sysmem_sysclib.h>
#include <sysmem_sysevent.h>
#include <sysmem_suspend_kernel.h>
#include <systimer.h>
#include <threadman_kernel.h>

#include <ctrl.h>

/* common defines */

#define USER_MODE                               0
#define KERNEL_MODE                             1

#define FALSE                                   0
#define TRUE                                    1

/** CTRL defines */

#define CTRL_POLL_MODE_OFF                      0
#define CTRL_POLL_MODE_ON                       1

#define CTRL_INTERNAL_CONTROLLER_BUFFERS        64
#define CTRL_MAX_INTERNAL_CONTROLLER_BUFFER     CTRL_INTERNAL_CONTROLLER_BUFFERS -1

#define CTRL_ANALOG_PAD_DEFAULT_VALUE           128
#define CTRL_ANALOG_PAD_MIN_VALUE               0
#define CTRL_ANALOG_PAD_MAX_VALUE               255

#define CTRL_MAX_EXTRA_SUSPEND_SAMPLES          300

#define CTRL_BUFFER_UPDATE_MIN_CUSTOM_CYCLES    5555
#define CTRL_BUFFER_UPDATE_MAX_CUSTOM_CYCLES    20000

#define CTRL_SAMPLING_MODES                     2
#define CTRL_SAMPLING_MODE_MAX_MODE             CTRL_SAMPLING_MODES -1

#define CTRL_BUTTON_CALLBACK_SLOTS              4
#define CTRL_DATA_EMULATION_SLOTS               4
#define CTRL_BUTTONS_RAPID_FIRE_SLOTS           16

#define CTRL_BUTTON_CALLBACK_MAX_SLOT           CTRL_BUTTON_CALLBACK_SLOTS -1
#define CTRL_DATA_EMULATION_MAX_SLOT            CTRL_DATA_EMULATION_SLOTS -1
#define CTRL_BUTTONS_RAPID_FIRE_MAX_SLOT        CTRL_BUTTONS_RAPID_FIRE_SLOTS -1

#define CTRL_USER_MODE_BUTTONS_DEFAULT          0x3F3F9
#define CTRL_USER_MODE_BUTTONS_EXTENDED         0x3FFFF
#define CTRL_ALL_SUPPORTED_BUTTONS              0x39FFF3F9
//SCE_CTRL_MS | SCE_CTRL_DISC | SCE_CTRL_REMOTE | SCE_CTRL_WLAN_UP | SCE_CTRL_HOLD | ?
#define CTRL_HARDWARE_IO_BUTTONS            0x3B0E0000


SCE_MODULE_INFO("sceController_Service", SCE_MODULE_KERNEL | SCE_MODULE_ATTR_CANT_STOP | SCE_MODULE_ATTR_EXCLUSIVE_LOAD
                                         | SCE_MODULE_ATTR_EXCLUSIVE_START, 1, 1);
SCE_MODULE_BOOTSTART("CtrlInit");
SCE_MODULE_REBOOT_BEFORE("CtrlRebootBefore");
SCE_SDK_VERSION(SDK_VERSION);


typedef struct {
    /** The pressed-button-range to check for. */
    u32 pressedButtonRange; //0
    /** The button(s) which will fire the pressed/un-pressed period for a button/buttons when being pressed.
     *  The button(s) has/have to be included in the pressed-button-range. *
     */
    u32 reqButtonsEventTrigger; //4
    /** The requested button(s) on which the pressed/un-pressed period (the rapid fire event) will be applied to.
     *  User mode buttons ONLY.
     */
    u32 reqButtons; //8
    /** Apply data for a rapidFire period. Keeps track of the apply mode of the requested button(s) (pressed/un-pressed)
     *  + the amount of left internal controller buffer updates for the current apply mode of the requested button(s).
     */
    u8 eventData; //12
    /** For how many (consecutive) internal controller buffer updates the requested button(s) will be set to ON (pressed). */
    u8 reqButtonsOnTime; //13
    /** For how many (consecutive) internal controller buffer updates the requested button(s) will be set to OFF (un-pressed). */
    u8 reqButtonsOffTime; //14;
    /** For how many (consecutive) internal controller buffer updates the requested button(s) will be set to ON.
     *  It will only be applied for the first ON period of a (not canceled) rapid fire event. */
    u8 reqButtonsEventOnTime; //15;
} SceCtrlRapidFire; //size of SceCtrlRapidFire: 16

typedef struct {
    /** Emulated analog pad X-axis offset. */
    u8 analogXEmulation; //0
    /** Emulated analog pad Y-axis offset. */
    u8 analogYEmulation; //1
    /** How many internal controller buffer updates the emulated analog pad values will be applied for. */
    u32 intCtrlBufUpdates; //4
    /** Emulated user buttons of ::PspCtrlButtons. You cannot emulate kernel buttons and
     *  the emulated buttons will only be applied for applications running in user mode.
     */
    u32 uModeBtnEmulation; //8
    /** Emulated buttons of ::PspCtrlButtons (you can emulate both user and kernel buttons).
     *  The emulated buttons will only be applied for applications running in kernel mode.
     */
    u32 kModeBtnEmulation; //12
    /** How many internal controller buffer updates the emulated buttons will be applied for. */
    u32 intCtrlBufUpdates2; //16
} SceCtrlEmulatedData; //size of SceCtrlEmulatedData: 20

typedef struct {
    /** Bitwise OR'ed button values (of ::PspCtrlButtons) which will be checked for being pressed. */
    u32 btnMask; //0
    /** Pointer to a callback function handling the button input effects. */
    SceCtrlCb callbackFunc; //4
    /** The global pointer value of the controller module. */
    u32 gp; //8
    /** An optional pointer being passed as the third argument to the callback function. */
    void *arg; //12
} SceCtrlButtonCallback; //Size of SceCtrlButtonCallback: 16

typedef struct {
    /** Button is newly pressed (was not already been pressed). */
    u32 btnMake; //0
    /** Stop of button press. */
    u32 btnBreak; //4
    /** Button is pressed. */
    u32 btnPress; //8
    /** Button is not pressed. */
    u32 btnRelease; //12
    /** Count the internal latch buffer reads. Is set to 0, when the buffer is reseted. */
    u32 readLatchCount; //16
    u32 ctrlBufStartIndex; //20
    u32 ctrlBufIndex; //24
    /** sceCtrlBuf has (indirectly) 64 pointers points to a unique internal controller buffer of type sceCtrlData. */
    void *sceCtrlBuf[3]; //28
} SceCtrlInternalData; //Size of SceCtrlInternalData: 40

typedef struct {
    SceSysTimerId timerID; //0
    int eventFlag; //4
    u32 btnCycle; //8
    SceCtrlPadInputMode samplingMode[CTRL_SAMPLING_MODES]; //12 -- samplingMode[0] for User mode, samplingMode[1] for Kernel mode -- correct
    u8 unk_Byte_0; //14
    u8 unk_Byte_1; //15
    u8 sysconBusy; //16
    u8 sysconBusyIntr2; //17 -- correct
    /** Reserved. */
    u8 resv[2]; //18
    u8 unk_Byte_2; //20
    SceCtrlPadPollMode pollMode; //21
    short int suspendSamples; //22
    s32 sysconTransfersLeft; //24
    SceSysconPacket sysPacket[2]; //28 -- size of one array member is 96.
    SceCtrlInternalData userModeData; //220
    SceCtrlInternalData kernelModeData; //260
    SceCtrlRapidFire rapidFire[CTRL_BUTTONS_RAPID_FIRE_SLOTS]; //300 - 555
    /** Currently pressed buttons passed to _SceCtrlUpdateButtons(). They are "pure",
     *  as custom settings are applied on them in ::_SceCtrlUpdateButtons. */
    u32 pureButtons; //556
    u32 unk_array_3[2]; //560 -- previous pressed button?
    u32 prevButtons; //568 -- previously pressed buttons
    /** Currently pressed User buttons. */
    u32 userButtons; //572
    /* Records the possibly user-modified, pressed buttons of the past VBlank interrupt before the current one. */
    u32 prevModifiedButtons; //576
    u8 analogX; //580;
    u8 analogY; //581
    char unk_Byte_9; //582
    char unk_Byte_3; //583
    SceCtrlEmulatedData emulatedData[CTRL_DATA_EMULATION_SLOTS]; //584
    u32 userModeButtons; //664
    /** Button bit mask defining buttons going to be supported (recognized if being pressed or not).
     *  Can be used to ignore buttons (buttons constantly turned off). */
    u32 maskSupportButtons; //668
    /** Button bit mask defining buttons going to be simulated as being pressed. */
    u32 maskSetButtons; //672
    int unk_4; //676
    int unk_5; //680
    int unk_6; //684
    int unk_7; //688
    int unk_8; //692
    int idleReset; //696
    int idleBack; //700
    SceCtrlButtonCallback buttonCallback[CTRL_BUTTON_CALLBACK_SLOTS]; //704
    int unk_9; //768
    ctrlUnkStruct *unk_array2[2]; //772 -- array of functions?
    int unk_array3[2]; //780
} SceCtrl; //size of SceCtrl: 788 (0x314)

static s32 _sceCtrlSysEventHandler(s32 ev_id, char* ev_name, void* param, s32* result); //0x00000364
static SceUInt _sceCtrlDummyAlarm(void *common); //sub_00001DD8
static int _sceCtrlVblankIntr(int subIntNm, void *arg); //sub_00000440
static int _sceCtrlTimerIntr(int, int, int, int); //sub_00000528
static int _sceCtrlSysconCmdIntr1(SceSysconPacket *sysPacket, void *argp); //sub_00000610;
static int _sceCtrlSysconCmdIntr2(SceSysconPacket *packet, void *argp); //sub_00001E4C
static int _sceCtrlUpdateButtons(u32 pureButtons, u8 aX, u8 aY); //sub_00000968
static int _sceCtrlReadBuf(SceCtrlDataExt *pad, u8 reqBufReads, int arg3, u8 mode); //sub_00001E70

SceCtrl ctrl; //0x2890
SceKernelDeci2Ops ctrlDeci2Ops = { 0x28, { (void *)sceCtrlGetSamplingMode, (void *)sceCtrlGetSamplingCycle,
                                           (void *)sceCtrlPeekBufferPositive, (void *)sceCtrlPeekLatch,
                                           (void *)sceCtrlSetRapidFire, (void *)sceCtrlClearRapidFire,
                                           (void *)sceCtrlSetButtonEmulation, (void *)sceCtrlSetAnalogEmulation,
                                           (void *)sceCtrlExtendInternalCtrlBuffers
                                         } }; //0x000027F8

SceSysEventHandler ctrlSysEvent = { sizeof(SceSysEventHandler), "SceCtrl", 0x00FFFF00, _sceCtrlSysEventHandler, 0, 0, NULL,
                                    { 0, 0, 0, 0, 0, 0, 0, 0, 0 } }; //0x00002850

SceCtrlData g_2BB0[CTRL_INTERNAL_CONTROLLER_BUFFERS]; //0x00002BB0
SceCtrlData g_2FB0[CTRL_INTERNAL_CONTROLLER_BUFFERS]; //0x00002FB0

/*
 * Subroutine sceCtrl_driver_121097D5 - Address 0x00000000
