/* Copyright (C) 2011, 2012 The uOFW team
   See the file COPYING for copying permission.
*/

/**
 * ctrl.c
 *    Reverse engineered controller libraries of the SCE PSP system.
 * Author: _Felix_
 * Version: 6.39
 * 
 */

#include "../ctrl/ctrl.h"

#define PSP_BUTTON_AMOUNT                       16  
#define PSP_INIT_KEYCONFIG_UPDATER              0x110 //might be incorrect

#define USER_MODE                               0
#define KERNEL_MODE                             1

#define FALSE                                   0
#define TRUE                                    1

#define CTRL_POLL_MODE_OFF                      0
#define CTRL_POLL_MODE_ON                       1

#define CTRL_INTERNAL_CONTROLLER_BUFFERS        64
#define CTRL_MAX_INTERNAL_CONTROLLER_BUFFER     CTRL_INTERNAL_CONTROLLER_BUFFERS -1

#define CTRL_ANALOG_PAD_DEFAULT_VALUE           128
#define CTRL_ANALOG_PAD_MIN_VALUE               0
#define CTRL_ANALOG_PAD_MAX_VALUE               255

#define CTRL_MAX_EXTRA_SUSPEND_SAMPLES          300

#define CTRL_BUFFER_UPDATE_MIN_CUSTOM_CYCLES    5555
#define CTRL_BUFFER_UPDATE_MAX_CUSTOM_CYCLES    20000

#define CTRL_SAMPLING_MODE_MODES                2
#define CTRL_SAMPLING_MODE_MAX_MODE             CTRL_SAMPLING_MODE_MODES -1

#define CTRL_BUTTON_CALLBACK_SLOTS              4
#define CTRL_DATA_EMULATION_SLOTS               4
#define CTRL_BUTTONS_RAPID_FIRE_SLOTS           16

#define CTRL_BUTTON_CALLBACK_MAX_SLOT           CTRL_BUTTON_CALLBACK_SLOTS -1
#define CTRL_DATA_EMULATION_MAX_SLOT            CTRL_DATA_EMULATION_SLOTS -1
#define CTRL_BUTTONS_RAPID_FIRE_MAX_SLOT        CTRL_BUTTONS_RAPID_FIRE_SLOTS -1

#define CTRL_USER_MODE_BUTTONS_DEFAULT          0x3F3F9
#define CTRL_USER_MODE_BUTTONS_EXTENDED         0x3FFFF
#define CTRL_ALL_SUPPORTED_BUTTONS              0x39FFF3F9
//PSP_CTRL_MS | PSP_CTRL_DISC | PSP_CTRL_REMOTE | PSP_CTRL_WLAN_UP | PSP_CTRL_HOLD | ?
#define CTRL_PSP_HARDWARE_IO_BUTTONS            0x3B0E0000


PSP_MODULE_INFO("sceController_Service", 0x1007, 1, 1);

typedef struct _SceCtrl {
    SceSysTimerId timerID; //0
    int eventFlag; //4
    u32 btnCycle; //8
    pspCtrlPadInputMode samplingMode[CTRL_SAMPLING_MODE_MODES]; //12 -- samplingMode[0] for User mode, samplingMode[1] for Kernel mode
    u8 unk_Byte_0; //14
    u8 unk_Byte_1; //15
    u8 unk_Byte_8; //16
    char unk_Byte_7; //17
    u8 unk_Byte_2; //20
    pspCtrlPadPollMode pollMode; //21
    u16 suspendSamples; //22
    int unk_1; //24
    SceSysconPacket sysPacket[2]; //28 -- size of one array member is 96.
    SceCtrlInternalData userModeData; //220
    SceCtrlInternalData kernelModeData; //260
    SceCtrlRapidFire rapidFire[CTRL_BUTTONS_RAPID_FIRE_SLOTS]; //300 - 555
    /** Currently pressed buttons passed to _SceCtrlUpdateButtons(). They are "pure", 
     *  as custom settings are applied on them in _SceCtrlUpdateButtons(). */
    int pureButtons; //556
    int unk_array_3[2]; //560 -- previous pressed button?
    int prevButtons; //568 -- previously pressed buttons
    /** Currently pressed User buttons. */
    int userButtons; //572
    /* Records the possibly user-modified, pressed buttons of the past VBlank interrupt before the current one. */
    int prevModifiedButtons; //576
    char analogX; //580;
    char analogY; //581
    char unk_Byte_9; //582
    char unk_Byte_3; //583
    SceCtrlEmulatedData emulatedData[CTRL_DATA_EMULATION_SLOTS]; //584
    u32 userModeButtons; //664
    /** Button bit mask defining buttons going to be supported (recognized if being pressed or not). 
     *  Can be used to ignore buttons (buttons constantly turned off). */
    u32 maskSupportButtons; //668
    /** Button bit mask defining buttons going to be simualated as being pressed. */
    u32 maskSetButtons; //672
    int unk_4; //676
    int unk_5; //680
    int unk_6; //684
    int unk_7; //688
    int unk_8; //692
    int idleReset; //696
    int idleBack; //700
    SceCtrlButtonCallback buttonCallback[CTRL_BUTTON_CALLBACK_SLOTS]; //704  
    int unk_array2[2]; //768 -- array of functions?
    int unk_array3[3]; //776
} SceCtrl; //sizeof SceCtrl: 788 (0x314)

typedef struct _SceCtrlRapidFire {
    /** The pressed-button-range to check for. */
    u32 pressedButtonRange; //0
    /** The button(s) which will fire the pressed/unpressed period for a button/buttons when being pressed. 
     *  The button(s) has/have to be included in the pressed-button-range. *
     */
    u32 reqButtonsEventTrigger; //4
    /** The requested button(s) on which the pressed/unpressed period (the rapid fire event) will be applied to. 
     *  User mode buttons ONLY. 
     */
    u32 reqButtons; //8
    /** Apply data for a rapidFire period. Keeps track of the apply mode of the requested button(s) (pressed/unpressed) 
     *  + the amount of left internal controller buffer updates for the current apply mode of the requested button(s). 
     */
    u8 eventData; //12
    /** For how many (consecutive) internal controller buffer updates the requested button(s) will be set to ON (pressed). */
    u8 reqButtonsOnTime; //13
    /** For how many (consecutive) internal controller buffer updates the requested button(s) will be set to OFF (unpressed). */
    u8 reqButtonsOffTime; //14;
    /** For how many (consecutive) internal controller buffer updates the requested button(s) will be set to ON. 
     *  It will only be applied for the first ON period of a (not canceled) rapid fire event. */
    u8 reqButtonsEventOnTime; //15;
} SceCtrlRapidFire; //sizeof SceCtrlRapidFire: 16

typedef struct _SceCtrlEmulatedData {
    /** Emulated analog pad X-axis offset. */
    u8 analogXEmulation; //0
    /** Emulated analog pad Y-axis offset. */
    u8 analogYEmulation; //1
    /** How many internal controller buffer updates the emulated analog pad values will be applied for. */
    u32 intCtrlBufUpdates; //4
    /** Emulated user buttons of ::PspCtrlButtons. You cannot emulate kernel buttons and 
     *  the emulated buttons will only be applied for applications running in user mode. 
     */
    u32 uModeBtnEmulation; //8
    /** Emulated buttons of ::PspCtrlButtons (you can emulate both user and kernel buttons).  
     *  The emulated buttons will only be applied for applications running in kernel mode. 
     */
    u32 kModeBtnEmulation; //12
    /** How many internal controller buffer updates the emulated buttons will be applied for. */
    u32 intCtrlBufUpdates2; //16
} SceCtrlEmulatedData; //sizeof SceCtrlEmulatedData: 20

typedef struct _SceCtrlButtonCallback {
    /** Bitwise OR'ed button values (of ::PspCtrlButtons) which will be checked for being pressed. */
    u32 btnMask; //0
    /** Pointer to a callback function handling the button input effects. */
    SceCtrlCb callbackFunc; //4
    /** The global pointer ($gp) value of the controller module. */
    u32 gp; //8
    /** An optional pointer being passed as the third argument to the callback function. */
    void *arg; //12    
} SceCtrlButtonCallback; //Size of SceCtrlButtonCallback: 16

typedef struct _SceCtrlInternalData {
    /** Button is newly pressed (was not already been pressed). */
    u32 btnMake; //0
    /** Stop of button press. */
    u32 btnBreak; //4
    /** Button is pressed. */
    u32 btnPress; //8
    /** Button is not pressed. */
    u32 btnRelease; //12
    /** Count the internal latch buffer reads. Is set to 0, when the buffer is reseted. */
    u32 readLatchCount; //16
    u32 ctrlBufStartIndex; //20
    u32 ctrlBufIndex; //24
    /** sceCtrlBuf[0] points to 64 internal ctrl buffers of type sceCtrlData. */
    void *sceCtrlBuf[3]; //28
} SceCtrlInternalData; //sizeof SceCtrlLatchInt: 40

//copied from http://holdpsp.googlecode.com/svn/trunk/sysconhk.h
typedef struct _SceSysconPacket {
    u8 unk00[4]; //0 -- (0x00,0x00,0x00,0x00)
    u8 unk04[2]; //4 -- (arg2)
    u8 status; //6
    u8 unk07; //7 -- (0x00)
    u8 unk08[4]; //8 -- (0xff,0xff,0xff,0xff)
    /** transmit data. */
    u8 tx_cmd; //12 -- command code
    u8 tx_len; //13 -- number of transmit bytes
    u8 tx_data[14]; //14 -- transmit parameters
    /** receive data. */
    u8 rx_sts; //28 --  generic status
    u8 rx_len; //29 --  receive length
    u8 rx_response; //30 --  response code(tx_cmd or status code)
    u8 rx_data[9]; //31 --  receive parameters
    u32 unk28; //40
    /** user callback (when finish an access?) */
    void (*callback)(SceSysconPacket *, u32); //44
    u32	callback_r28; //48
    u32	callback_arg2; //52 -- arg2 of callback (arg4 of sceSycconCmdExec)
    u8 unk38[13]; //56
    u8 old_sts;	//69 -- old rx_sts
    u8 cur_sts;	//70 --  current rx_sts
    u8 unk47[33]; //71
} SceSysconPacket; //sizeof SceSysconPacket: 96

typedef UnknownType;

SceCtrl ctrl; //0x2890
SceKernelDeci2Ops ctrlDeci2Ops; //0x000027F8
_PspSysEventHandler ctrlSysEvent; //0x00002850

static SceUInt _sceCtrlDummyAlarm(void *common); //0x00001DD8
static int _sceCtrlVblankIntr(int subIntNm, void *arg); //0x00000440
static int _sceCtrlTimerIntr(); //sub_00000528
static int _sceCtrlSysconCmdIntr1(); //0x00000610;
static int _sceCtrlSysconCmdIntr2(); //sub_00001E4C
static int _sceCtrlUpdateButtons(u32 pureButtons, u8 aX, u8 aY); //sub_00000968
static int _sceCtrlReadBuf(void *pad, u8 reqBufReads, int arg3, u8 mode); //sub_00001E70


/* sub_00001DD8 */
static SceUInt _sceCtrlDummyAlarm(void *common) {
    int suspendFlag;
    u32 pureButtons;
    
    suspendFlag = sceKernelCpuSuspendIntr(); //0x00001DE8
    pureButtons = ctrl.pureButtons; //0x00001E00
    if (ctrl.unk_1 == 0) { //0x00001DF8       
        pureButtons &= 0xFFFE0000; //0x00001E04 -- kernel button values?     
    }
