/* Copyright (C) 2011, 2012, 2013, 2014 The uOFW team
   See the file COPYING for copying permission.
*/

#include <common_imp.h>
#include <interruptman.h>
#include <iofilemgr_kernel.h>
#include <loadcore.h>
#include <modulemgr.h>
#include <modulemgr_options.h>
#include <sysmem_kernel.h>
#include <threadman_kernel.h>

#include "modulemgr_int.h"

#define SET_MCB_STATUS(v, m) (v = (v & 0xFFF0) | m)

typedef struct {
    SceUID threadId; // 0
    SceUID semaId; // 4
    SceUID eventId; // 8
    SceUID userThreadId; // 12
    u32 unk16;
    u32 unk20;
    u32 unk24;
    u32 unk28;
    u32 unk32;
    u32 unk36;
} SceModuleManagerCB;

typedef struct
{
	u8 modeStart; //0 The Operation to start on, Use one of the ModuleMgrExeModes modes
	u8 modeFinish; //1 The Operation to finish on, Use one of the ModuleMgrExeModes modes
	u8 position; //2
	u8 access; //3
	//u32 apitype; //4
	SceUID *returnId; //4
	SceModule *mod; //12
    /*
	SceUID mpidText; //16
	SceUID mpidData; //20
	SceUID mpidStack; //24
	SceSize stackSize; //28
	int priority; //32
	u32 attribute; //36
	SceUID modid; //40
	SceUID callerModid; //44
	SceUID fd; //48
     */
	SceLoadCoreExecFileInfo *execInfo; //16
    u32 apiType; //20
    SceUID fd; // 24
    SceUID modId; //52
    SceUID callerModId; //56
	void *file_buffer; //60
    u32 unk64;
	SceSize argSize; //68
	void *argp; //72
	u32 unk_76;
	u32 unk_80;
	int *status; //84
	u32 eventId; //88
    u32 unk100;
    u32 unk124;
    SceUID memBlockId; //144
    u32 unk148;
    SceOff memBlockOffset; // 152
} SceModuleMgrParam; //size = 160

enum ModuleMgrExecModes
{
	CMD_LOAD_MODULE, //0
	CMD_RELOCATE_MODULE, //1
	CMD_START_MODULE, //2
	CMD_STOP_MODULE, //3
	CMD_UNLOAD_MODULE, //4
};

SCE_MODULE_INFO("sceModuleManager", SCE_MODULE_KIRK_MEMLMD_LIB | SCE_MODULE_KERNEL | SCE_MODULE_ATTR_CANT_STOP | 
                                 SCE_MODULE_ATTR_EXCLUSIVE_LOAD | SCE_MODULE_ATTR_EXCLUSIVE_START, 1, 
                                 18);
SCE_MODULE_BOOTSTART("ModuleMgrInit");
SCE_MODULE_REBOOT_BEFORE("ModuleMgrRebootBefore");
SCE_MODULE_REBOOT_PHASE("ModuleMgrRebootPhase");
SCE_SDK_VERSION(SDK_VERSION);

SceModuleManagerCB g_ModuleManager; // 0x00009A20


// TODO: Reverse function sub_00000000
// 0x00000000
void sub_00000000()
{
}

// 0x000000B0
s32 _UnloadModule(SceModule *pMod)
{
    u32 modStat;
    
    modStat = (pMod->status & 0xF);
	if (modStat < MCB_STATUS_LOADED || (modStat >= MCB_STATUS_STARTING && modStat != MCB_STATUS_STOPPED))
